#ifndef __WR99_CUIF_H__
#define __WR99_CUIF_H__

// ----------------- WR99_CUIF Register Definition -------------------
typedef volatile struct {
    kal_uint32 RXBRP_CCm_TRCH_EN_OR_EBD[2];                                               // 0x8004..0x8008
    kal_uint32 RXBRP_CCm_FRAME_IDX[2];                                                    // 0x8014..0x8018
    kal_uint32 RXBRP_CCm_PHCH[2];                                                         // 0x801C..0x8020
    kal_uint32 RXBRP_CCm_BTFD_DMA_DST_CALC[2];                                            // 0x8024..0x8028
    kal_uint32 RXBRP_CCm_BTFD_PARAMk[6];                                                  // 0x802C..0x8040
    kal_uint32 RXBRP_CCm_BTFD_STOP_POINTk[32];                                            // 0x8044..0x80C0
    kal_uint32 RXBRP_CCm_BTFD_CRC_POINTk[32];                                             // 0x80C4..0x8140
    kal_uint32 RXBRP_TRCHm_E_PLUS[16];                                                    // 0x8144..0x8180
    kal_uint32 RXBRP_TRCHm_E_MINUS[16];                                                   // 0x8184..0x81C0
    kal_uint32 RXBRP_TRCHm_CLEN[16];                                                      // 0x81C4..0x8200
    kal_uint32 RXBRP_TRCHm_BASEP[16];                                                     // 0x8204..0x8240
    kal_uint32 RXBRP_TRCHm_TRBK[16];                                                      // 0x8244..0x8280
    kal_uint32 RXBRP_TRCHm_COBK[16];                                                      // 0x8284..0x82C0
    kal_uint32 RXBRP_TRCHm_DST_ADDR[16];                                                  // 0x82C4..0x8300
    kal_uint32 RXBRP_TRCHm_DMA_CFG[16];                                                   // 0x8304..0x8340
    kal_uint32 RXBRP_BCH_DMA_CFG;                                                         // 0x8344
    kal_uint32 RXBRP_BCH_DST_ADDR;                                                        // 0x8348
    kal_uint32 RXBRP_CCm_TFk_ENERGY[32];                                                  // 0x834C..0x83C8
    kal_uint32 RXBRP_CCm_BTFD_RESULTk[6];                                                 // 0x83CC..0x83E0
    kal_uint32 RXBRP_TRCHm_TBCRC_STATUS[16];                                              // 0x83E4..0x8420
    kal_uint32 RXBRP_TRCHm_ENERGY[16];                                                    // 0x8424..0x8460
    kal_uint32 RXBRP_TRCHm_CBkSVALUE[80];                                                 // 0x8464..0x85A0
    kal_uint32 RXBRP_BCH_SFN;                                                             // 0x85A4
    kal_uint32 RXBRP_BCH_SVALUE;                                                          // 0x85AC
    kal_uint32 RXBRP_CCm_PARAM[2];                                                        // 0x8710..0x8714
    kal_uint32 RXBRP_TRCHm_CFG[16];                                                       // 0x8798..0x87D4
    kal_uint32 RXBRP_BCH_START;                                                           // 0x87D8
    kal_uint32 RXBRP_BCHSFN_STOP;                                                         // 0x87DC
    kal_uint32 RXBRP_CCm_TRCH_EN_OR_EBD_IRQ[2];                                           // 0x87EC..0x87F0
    kal_uint32 RXBRP_CCm_BTFD_PHASE_ACT[2];                                               // 0x87F4..0x87F8
    kal_uint32 RXBRP_BCH_GNRL_CFG;                                                        // 0x87FC
    kal_uint32 RXBRP_CCm_3GLORX_EN[2];                                                    // 0x8800..0x8804
    kal_uint32 RXBRP_CCm_3GLORX_VALID_DATA_NUM[2];                                        // 0x8808..0x880C
    kal_uint32 RXBRP_CCm_3GLORX_SVALUE_THRESHOLD[2];                                      // 0x8810..0x8814
    kal_uint32 RXBRP_CCm_3GLORX_EBD_COEFF[2];                                             // 0x8818..0x881C
    kal_uint32 RXBRP_CCm_3GLORX_DUAL_COEFF[2];                                            // 0x8820..0x8824
    kal_uint32 RXBRP_3GLORX_DFE_PULSE;                                                    // 0x8828
    kal_uint32 RXBRP_CCm_EBD_DEC_TRCH_MASK[2];                                            // 0x882C..0x8830
    kal_uint32 RXBRP_CCm_STOP[2];                                                         // 0x8834..0x8838
    kal_uint32 RXBRP_CCm_SYMBOL_NUM[2];                                                   // 0x883C..0x8840
    kal_uint32 RXBRP_CCm_SYMBOL_SUM[2];                                                   // 0x8844..0x8848
    kal_uint32 RXBRP_CCm_BUFIDX[2];                                                       // 0x884C..0x8850
    kal_uint32 RXBRP_CCm_SUSPEND_GAP[2];                                                  // 0x8854..0x8858
    kal_uint32 RXBRP_CCm_WRITE_PHCH_TWICE[2];                                             // 0x8860..0x8864
    kal_uint32 RXBRP_CCm_TRCH_DONE[2];                                                    // 0x88BC..0x88C0
    kal_uint32 RXBRP_TRCHm_TTI_MIN_SCF[16];                                               // 0x88E4..0x8920
    kal_uint32 RXBRP_BCHSFN_GUARD_TIME;                                                   // 0x8924
} WR99_CUIF_REGS, *PWR99_CUIF_REGS;

// ---------- WR99_CUIF word-offset  ----------
#define O_WR99_CUIF_RXBRP_CCm_TRCH_EN_OR_EBD(i)                                           (1 + (i))
#define O_WR99_CUIF_RXBRP_CCm_FRAME_IDX(i)                                                (5 + (i))
#define O_WR99_CUIF_RXBRP_CCm_PHCH(i)                                                     (7 + (i))
#define O_WR99_CUIF_RXBRP_CCm_BTFD_DMA_DST_CALC(i)                                        (9 + (i))
#define O_WR99_CUIF_RXBRP_CCm_BTFD_PARAMk(i)                                              (11 + (i))
#define O_WR99_CUIF_RXBRP_CCm_BTFD_STOP_POINTk(i)                                         (17 + (i))
#define O_WR99_CUIF_RXBRP_CCm_BTFD_CRC_POINTk(i)                                          (49 + (i))
