/*****************************************************************************
*  Copyright Statement:
*  --------------------
*  This software is protected by Copyright and the information contained
*  herein is confidential. The software may not be copied and the information
*  contained herein may not be used or disclosed except with the written
*  permission of MediaTek Inc. (C) 2005
*
*  BY OPENING THIS FILE, BUYER HEREBY UNEQUIVOCALLY ACKNOWLEDGES AND AGREES
*  THAT THE SOFTWARE/FIRMWARE AND ITS DOCUMENTATIONS ("MEDIATEK SOFTWARE")
*  RECEIVED FROM MEDIATEK AND/OR ITS REPRESENTATIVES ARE PROVIDED TO BUYER ON
*  AN "AS-IS" BASIS ONLY. MEDIATEK EXPRESSLY DISCLAIMS ANY AND ALL WARRANTIES,
*  EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF
*  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NONINFRINGEMENT.
*  NEITHER DOES MEDIATEK PROVIDE ANY WARRANTY WHATSOEVER WITH RESPECT TO THE
*  SOFTWARE OF ANY THIRD PARTY WHICH MAY BE USED BY, INCORPORATED IN, OR
*  SUPPLIED WITH THE MEDIATEK SOFTWARE, AND BUYER AGREES TO LOOK ONLY TO SUCH
*  THIRD PARTY FOR ANY WARRANTY CLAIM RELATING THERETO. MEDIATEK SHALL ALSO
*  NOT BE RESPONSIBLE FOR ANY MEDIATEK SOFTWARE RELEASES MADE TO BUYER'S
*  SPECIFICATION OR TO CONFORM TO A PARTICULAR STANDARD OR OPEN FORUM.
*
*  BUYER'S SOLE AND EXCLUSIVE REMEDY AND MEDIATEK'S ENTIRE AND CUMULATIVE
*  LIABILITY WITH RESPECT TO THE MEDIATEK SOFTWARE RELEASED HEREUNDER WILL BE,

 * removed!
 * removed!
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 *
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 * removed!
 * removed!
 * removed!
 *
 *------------------------------------------------------------------------------
 * Upper this line, this part is controlled by PVCS VM. DO NOT MODIFY!!
 *============================================================================
 ****************************************************************************/
#ifndef __IMS_NVRAM_EDITOR_H__
#define __IMS_NVRAM_EDITOR_H__

#ifndef NVRAM_NOT_PRESENT
#ifdef __cplusplus
extern "C"
{
#endif /* __cplusplus */ 

#include "ims_nvram_def.h"

#define NVRAM_EF_IMS_PROFILE_LID_VERNO                      "077"
#define NVRAM_EF_IMS_PROVISIONING_PROFILE_LID_VERNO         "001"
#define NVRAM_EF_DRP_IMS_PROFILE_LID_VERNO                  "000"
#define NVRAM_EF_LTECSR_PROFILE_LID_VERNO                   "001"
#define NVRAM_EF_DRP_LTECSR_PROFILE_LID_VERNO               "000"

#ifdef __VOLTE_SUPPORT__
#define NVRAM_EF_VDM_ADS_PROFILE_LID_VERNO                    "026"
#define NVRAM_EF_VDM_NV_DATA_LID_VERNO                        "001"
#endif
#define NVRAM_EF_SDM_ADS_PROFILE_LID_VERNO "008"
#define NVRAM_EF_SDM_CUST_ADS_PROFILE_LID_VERNO "008"
#define NVRAM_EF_HVOLTE_E911_LID_VERNO  "001"

#if defined (__MOD_IMC__)
typedef struct{
  kal_uint32    local_port;                // 5060
  kal_uint32    pcscf_port_number;         // 5060
  kal_uint32    ipsec_local_port_start;    // 50000
  kal_uint32    ipsec_local_port_range;    // 50
  kal_uint32    rtp_rtcp_local_port_start; // 40000
  kal_uint32    rtp_rtcp_local_port_range; // 5000
  kal_uint32    rtcp_interval;             // 5000
  kal_uint16    sip_dscp;                  // 0
  kal_uint16    sip_priority;              // 0
  kal_uint16    audio_dscp;                // 0
  kal_uint16    audio_priority;            // 0
  kal_uint16    video_dscp;                // 0
  kal_uint16    video_priority;            // 0
  kal_uint32    register_expiry;       // 600000
  kal_uint32    UA_reg_t1_timer;       // 2000
  kal_uint32    UA_reg_t2_timer;       // 16000
  kal_uint32    UA_reg_t4_timer;       // 17000
  kal_uint32    UA_reg_a_timer;                 // 0
  kal_uint32    UA_reg_b_timer;                 // 0
  kal_uint32    UA_reg_c_timer;                 // 180000
  kal_uint32    UA_reg_d_timer;                 // 128000
  kal_uint32    UA_reg_e_timer;                 // 0
  kal_uint32    UA_reg_f_timer;                 // 0
  kal_uint32    UA_reg_g_timer;                 // 0
  kal_uint32    UA_reg_h_timer;                 // 0
  kal_uint32    UA_reg_i_timer;                 // 0
  kal_uint32    UA_reg_j_timer;                 // 0
  kal_uint32    UA_reg_k_timer;                 // 0
  kal_uint32    UA_reg_retry_base_time;
  kal_uint32    UA_reg_retry_max_time;
  kal_uint32    UA_call_conf_subtimer;      // 3600
  kal_uint32    UA_call_session_timer;   // 60000
  kal_uint32    UA_call_amr_fmt_variant; // 0

  kal_uint8     VoLTE_Setting_SIP_Force_Use_UDP; // 0(default), 1
  kal_uint8     VoLTE_Setting_SIP_TCP_On_Demand; // 0, 1(default)
  kal_uint16    VoLTE_Setting_SIP_TCP_MTU_Size;  // 1300(default)
  kal_uint32    VoLTE_Setting_SIP_TCP_MSS;       // 1200(default)

  kal_uint16    UA_call_session_min_se;  // 1800
  kal_uint16    UA_call_rej_code;        // 486
  kal_uint16    UA_call_no_resource_code;// 480
  kal_uint16    UA_call_rej_media_code;  // 488
  kal_uint16    UA_call_rej_by_user_code; // 486
  kal_uint16    operator_code;
  kal_uint16    sms_rspcode;             //200
  kal_uint16    pad1;
  kal_uint8     local_sip_protocol_type;   // 1 = UDP, 2 = TCP, default 1
  kal_uint8     UA_g711_ptime;         // 20
  kal_uint8     UA_g726_ptime;         // 20
  kal_uint8     UA_call_codec_order1;  // 1
  kal_uint8     UA_call_codec_order2;  // 2
  kal_uint8     UA_call_codec_order3;  // 5
  kal_uint8     UA_call_def_max_ptime; // 80
  kal_uint8     UA_call_def_ptime;     // 20
  kal_uint8     UA_call_amr_pt;        // 97
  kal_uint8     UA_call_amr_oct_pt;    // 108
  kal_uint8     UA_call_amr_open_pt;   // 106
  kal_uint8     UA_call_amr_wb_pt;     // 98
  kal_uint8     UA_call_amr_wb_oct_pt; // 110
  kal_uint8     UA_call_h264_pt;       // 99
  kal_uint8     UA_call_h264_pt2;      // 100
  kal_uint8     UA_call_h265_pt;       // 101
  kal_uint8     UA_call_h265_pt2;      // 102
  kal_uint8     UA_call_evs_pt;        // 127
  kal_uint8     UA_call_g729_annexb;   // 1
  kal_uint8     UA_call_g729_ptime;    // 20
  kal_uint8     UA_call_priority;      // 0
  kal_uint8     UA_call_privacy;       // 0
  kal_uint8     UA_call_session_flag;    // 1
  kal_uint8     UA_call_tel_evt;         // 1
  kal_uint8     UA_call_tel_evt_pt;      // 100
  kal_uint8     UA_call_tel_evt_wb_pt;   // 105
  kal_uint8     UA_call_precondition;
  kal_uint8     early_media;             //0
  kal_uint8     mwi_license;             //0:disable, 1:enable, default 0
  kal_uint8     UA_reg_keep_alive;    // 1
  kal_uint8     uri_type;             // bitmap: sip=0x01, tel=0x02, urn=0x04
  kal_uint8     UA_net_ipsec;           //0:None, 1:UA_net_ipsec
  kal_uint8     UA_reg_uri_with_port;   //0:disable, 1:enable
  kal_uint8     UA_reg_ipsec_algo;
  kal_uint8     UA_reg_http_digest;    //0:AKAv1_MD5, 1:MD5 2:AKAv2_MD5
  kal_uint8     UA_reg_specific_ipsec_algo;
  kal_uint8     UA_call_mo_invite_to_bw_cnf_time;  // 0
  kal_uint8     ipv6_zero_compression;                // 0 (0: disable, 1: enable)
  kal_uint8     support_max_retry_algo; // 0
  kal_uint8     UA_ussd_nw_timeout_timer;
  kal_uint8     UA_ussd_setup_timeout_timer;
  kal_uint8     reject_early_dlg_more_than_max; // 0
  kal_uint8     send_bye_when_term_early_dlg;   // 0
  kal_bool      tty_enable; // default: 0
  kal_uint8     tty_t140_pt; // default: 111
  kal_uint8     tty_red_pt; // default: 112
  kal_uint8     tty_red_level; // default: 2
  kal_uint8     tty_cps; // default: 30
  kal_uint8     user_agent[128];          // VoLTE/WFC UA
  kal_uint8     UA_call_amr_mode_set[16];      // string: 0,1,2,3,4,5,6,7
  kal_uint8     UA_call_amr_wb_mode_set[20];   // string: 0,1,2,3,4,5,6,7,8
  kal_uint8     UA_icsi_1[64]; // string: urn:urn-7:3gpp-service.ims.icsi.mmtel
  kal_uint8     UA_icsi_2[64]; // string: urn:urn-7:3gpp-service.ims.icsi.mmtel
  kal_uint8     UA_icsi_3[64]; // string: urn:urn-7:3gpp-service.ims.icsi.mmtel
  kal_uint8     UA_icsi_4[64]; // string: urn:urn-7:3gpp-service.ims.icsi.mmtel
  kal_uint8     UA_phone_context[64];
  kal_uint8     UA_reg_auth_name[64];      // +18860000042@srnims3.srnnam.nsn-rdnet.net
  kal_uint8     UA_reg_auth_password[32];  // ims123456
  kal_uint8     UA_phone_context_associated_impu[128];
  kal_uint8     UA_conf_factory_uri[128];

  /* Extend UA internal config to NVRAM */
  /* Call */
  kal_uint32    reject_code_in23G;              // 503
  kal_uint32    conf_sub_timer_timeout;         // 3600
  kal_uint32    cisrvcc;                        // 0
  kal_uint8     contact_with_username_inCall;   // 1
  kal_uint8     sendrecv_before_prcd;           // 1
  kal_uint8     always_use_UPDATE_for_prcd;     // 0
  kal_uint8     merge_need_swap;                // 0
  kal_uint8     always_use_sip_uri_for_mo_call; // 1
  kal_uint8     set_strength_mandatory;         // 0
  kal_uint8     send_refer_to_peer;             // 0
  kal_uint8     add_3gpp_ims_in_Accept;         // 0
  kal_uint8     terminal_based_cw;              // 1
  kal_uint8     refer_dialog_to_server;         // 0
  kal_uint8     check_reason_phrase;            // 0
  kal_uint8     merge_send_bye;                 // 1
  kal_uint8     when_stop_tcall;                // 101
  kal_uint8     set_rtcp_0;                     // 0
  kal_uint8     check_contact_380;              // 0
  kal_uint8     conf_participant_not_subscribe; // 0
  kal_uint8     add_sdp_in_180_for_non_precond; // 0
  kal_uint8     add_precondition_in_hold_unhold_sdp;    // 1
  kal_uint8     use_org_sdp_for_invite_without_sdp;     // 0
  kal_uint8     oir_privacy_to_header;          // 0
  kal_uint8     register_cap_whenever;          // 0
  kal_uint8     no_auto_retry_for_mo_call;      // 0
  kal_uint8     use_eps_prefix_in_phone_context;// 1
  kal_uint8     follow_nw_ims_vops_support;     // 0
  kal_uint8     attempt_reg_when_receive403;    // 1
  kal_uint8     waiting_487_for_cancel_timer_timeout;   // 0
  kal_uint8     bcsfb_feature_enable;           // 0
  kal_uint8     send_183_when_prcd_none;        // 1
  kal_uint8     call_id_with_host_inCall;       // 0
  kal_uint8     add_rtcp_port_into_sdp;         // 0
  kal_uint8     ecc_session_timer_enable;       // 1
  kal_uint8     subscribe_dialog_to_server;     // 0
  kal_uint8     check_conference_subscribe;     // 0
  kal_uint8     conference_subscribe_timing;    // 0
  kal_uint8     general_amr_nb_wb;              // 0
  kal_uint8     disable_conf_call_prcd;         // 0
  kal_uint8     wait_cancel_in_srvcc_end;       // 0
  kal_uint8     reject_1w_if_1A1H;              // 0
  kal_uint8     no_auto_retry_for_dcm_mo_call;  // 0
  kal_uint8     join_send_bye;                  // 1
  kal_uint8     set_zero_cell_id_in_wifi;       // 0
  kal_uint8     reject_mtcall_by_vops;          // 0
  kal_uint8     reject_mtcall_when_vilte;       // 0
  kal_uint8     not_add_SDP_in_OPTIONS;         // 0
  kal_uint8     pcscf_error_when663;            // 0
  kal_uint8     rel_conf_if_no_participant;     // 0
  kal_uint8     add_no_fork;                    // 0
  kal_uint8     TMO_specific_SDP;               // 0
  kal_uint16    call_ringing_timer_timeout;     // 0
  kal_uint16    call_ringback_timer_timeout;    // 0
  kal_uint8     call_tcall_timer_timeout;       // 10
  kal_uint8     call_refreshcall_timer_expire;  // 0
  kal_uint8     call_callend_timer_timeout;     // 10
  kal_uint8     waiting_mt_cnf_timer_timeout;   // 30
  kal_uint8     mo_invite_to_bw_cnf_timer_timeout;  // 0
  kal_uint8     evs_support;                    // 0
  kal_uint8     evs_mode_switch;                // 0
  kal_uint8     hf_only;                        // 0
  kal_uint8     dtx;                            // 1
  kal_uint8     dtx_recv;                       // 1
  kal_uint8     br_begin;                       // 0
  kal_uint8     br_end;                         // 11
  kal_uint8     br_send_begin;                  // 0
  kal_uint8     br_send_end;                    // 11
  kal_uint8     br_recv_begin;                  // 0
  kal_uint8     br_recv_end;                    // 11
  kal_uint8     bw_begin;                       // 0
  kal_uint8     bw_end;                         // 1
  kal_uint8     bw_send_begin;                  // 0
  kal_uint8     bw_send_end;                    // 1
  kal_uint8     bw_recv_begin;                  // 0
  kal_uint8     bw_recv_end;                    // 1
  kal_uint8     ch_send;                        // 1
  kal_uint8     ch_recv;                        // 1
  kal_int8      ch_aw_recv;                     // 0
  kal_int8      cmr;                            // 0
  kal_uint8     short_code_support;             // 0
  kal_uint8     early_media_when_rtp_coming;    // 0
  kal_uint8     session_refresher_in_req;       // 0
  kal_uint8     session_refresher_in_resp;      // 0
  kal_uint8     wfc_emerg_pidf_country;         // 0
  kal_uint8     set_des_strength_optional;      // 0
  kal_uint8     conf_user_count_includes_host;  // 1
  kal_uint8     ecn_init_method;                // 0
  kal_uint8     histinfo_in_supported;          // 0
  kal_uint8     add_country_to_pani;            // 0
  kal_uint8     delay_unhold_call;              // 0
  kal_uint8     use_pub_uid_in_ref_to;          // 0
  kal_uint8     prefer_original_codec;          // 1
  kal_uint8     add_audio_video_in_delay_media; // 1
  kal_uint8     add_contact_in_bye;             // 0
  kal_uint8     resp_precondition_without_bw_cnf; // 0
  kal_uint8     wait_second_invite_for_hold;    // 0
  kal_uint8     no_feature_caps_process;        // 0
  kal_uint8     delay_ringing;                  // 0
  kal_uint8     add_framerate;                  // 0
  kal_uint8     add_framesize;                  // 0
  kal_uint8     add_imageattr;                  // 0
  kal_uint8     force_srvcc_transfer;           // bitmap: bit 0: hold call(mid-call srvcc), default 1
                                                //         bit 1: conference call(mid-call SRVCC) default 1
                                                //         bit 2: alerting call(aSRVCC), default 1
                                                //         bit 3: pre-alerting call(bSRVCC), default 0
  kal_uint16    srvcc_feature_enable;           // bitmap: bit 0: SRVCC, default 1
                                                //         bit 1: aSRVCC default 1
                                                //         bit 2: midSRVCC, default 1
                                                //         bit 3: bSRVCC, default 1
  kal_uint8     rtcp_xr_support;                // 0
  kal_uint16    rtcp_xr_format;                 // 0x0030
  kal_uint16    rtcp_xr_loss_maxsize;           // 0
  kal_uint16    rtcp_xr_dup_maxsize;            // 0
  kal_uint16    rtcp_xr_rcpt_maxsize;           // 0
  kal_uint16    rtcp_xr_rtt_maxsize;            // 0
  kal_uint8     rtcp_xr_rtt_mode;               // 0
  kal_uint8     rtcp_xr_stat_flags;             // 0x17
  kal_uint8     show_octet_align;               // 1
  kal_uint8     video_conf_if_one_is_video;     // 0
  kal_uint8     use_from_to_append_pau;         // 1
  kal_uint8     call_rel_holdcall_in_midcall_SRVCC;    //0
  kal_uint8     call_lte_emc_timer_timeout;     // 0
  kal_uint8     always100rel_in_resp;           // 0
  kal_uint8     use_183_for_early_media;        // 0
  kal_uint32    call_pull_sub_expire;           // 0
  kal_uint8     be_refresher_without_peer_support; //0
  kal_uint8     ect_assured_notify_timer_timeout; // 30s
  kal_uint8     ect_new_call_type;              // 0
  kal_uint8     ect_refer_in_new_dialog;        // 0
  kal_uint8     ect_without_target_hold;        // 0
  kal_uint8     ect_default_type;               // 2 (Assured ECT)
  kal_uint8     ect_refer_to_tag_swap;          // 0
  kal_uint8     UA_call_conf_amr_wb_mode_set[20];  // string: 0,1,2,3,4,5,6,7,8
  kal_uint8     session_id_header_enable;       // 0
  kal_uint8     video_action_precondition;      // 0
  kal_uint8     bypass_conf_qos_check_in_delay_media; // 0
  kal_uint8     transfer_conf_call_as_1to1;     // 1
  kal_uint8     timer_b_restore_reg;            // 1
  kal_bool      check_curr_qos;                 // 0
  kal_uint16    reject_no_answer_resp_code;     // 486
  kal_uint16    call_ringing_timeout_code;      // 486
  kal_uint8     auto_unhold_when_rcv_recvonly;  // 0
  kal_bool      sendrecv_before_conf_call_prcd; // 0
  kal_uint8     err_handling_for_video_via_update;  // 1
  kal_uint8     pem_use_sdp_rtp_drct;           // 0
  kal_uint8     ignore_trans_err_in_active;	    // 1
  kal_uint8     add_cni_in_wifi;                // 0
  kal_bool      text_feature_tag;               // 0
  kal_uint8     call_emc_rtt_cb_timeout;        // 0
  kal_uint8     disable_amr_params_in_wfc_call; // bitmap: bit 0: amr-mode-change-period, default 0
                                                //         bit 1: amr-mode-change-neighbor, default 0
  kal_uint32    reg_expire_time_backup;         // 0
  kal_uint8     mod_session_cnf_timer_timeout;  // 0
  kal_uint32    emc_call_ringback_timer_timeout;// 0
  kal_uint8     add_pcni_in_vowifi;             // 0
  kal_uint8     altc_support;                   // 0
  kal_uint8     altc_prefer_offer;              // 0
  kal_uint8     altc_prefer_answer;             // 0
  kal_uint8     asymmetric_payload_type_enable; // 0
  kal_uint8     max_hold_unhold_retry_cnt;      // 2
  kal_uint8     disable_ul_rtp_in_early_state;  // 0
  kal_uint8     support_early_upgrade;          // 0
  kal_uint16    pqos_timer_timeout;             // 2000
  kal_uint8     upgrade_cancel_feature;         // 0
  kal_uint8     upgrade_with_Tupo;              // 0 
  kal_uint8     rtt_enable;                     // 0 UA should reference this for RTT
  kal_bool      ect_enable;                     // 0
  kal_uint32    refer_delay_timer;              // 0
  kal_bool      allow_non_sendrecv_rtcp_0;          // 0
  kal_uint32    keep_original_refresher_in_reinvite; // 0
  kal_uint8     force_csfb_when663;                 // 0
  kal_uint8     decouple_conf_srvcc_mid_call_cap;   // 0
  kal_uint8     send_refer_to_conf_uri;             // 0
  kal_uint8     conference_desub_time;              // 30
  kal_uint8     call_mo_pidf_usage;                 // bitmap: bit 0: WFC emergency, default 0 (enabled)
                                                    //         bit 1: WFC normal, default 0 (enabled)
                                                    //         bit 2: VoLTE emergency, default 1 (disabled)
                                                    //         bit 3: VoLTE normal, default 1 (disabled)
  kal_bool      omit_method_invite_in_refer_to;     // 0
  kal_uint8     video_offer_rtp_profile;            // 0xFF
  kal_uint32    e3_emc_setup_catch_all_roaming_timer;// 0
  kal_uint32    e2_emc_setup_initiation_timer;      // 0
  kal_uint32    e3_emc_setup_catch_all_home_timer;  // 0
  kal_uint8     support_video_early_media;          // 0
  kal_uint8     disable_tcall_timer_in_hold;        // 0
  kal_uint8     set_homeuri_from_pau;               // 0
  kal_uint8     enable_in_band_tone_in_hold;        // 0
  kal_bool    	set_text_rtcp_0;   					// 1
  kal_uint8     use_lower_anonymous;                // 0
  kal_uint8    reg_restore_try_next_pcscf;          // 0
  kal_uint8    reject_text_when_text_off;           // 1
  kal_uint8     active_state_oos_level;             // 0
  kal_uint8     remove_aconf_when_reinvite_without_sdp;// 0
  kal_uint8     ecall_get_puid_from_normal_ims_reg;    // 0
  kal_bool      send_bye_if_error_resp_in_hold_unhold; // 1
  kal_uint32    merge_send_bye_delay;                  // 2 seconds
  kal_uint8     required_loc_info_num_set[128];        // 0
  kal_uint8     ignore_380_emg_xml;                    // 0
  kal_uint8     evs_fmtp_variant_pt;                   // 0
  kal_uint8     evs_configuration_profile;             // 0xff
  kal_uint8     evs_configuration_profile_2;           // 0xff
  kal_bool      call_barring_in_warning_header;        //0
  kal_bool      use_amr_bit_rate_downgrade;            //0
  kal_bool      re_calc_rr_rs_in_offer_answer;         //0  
  kal_bool      send_bw_ind_when_recv_183_prack;       //0
  kal_bool      support_ringing_downgrade;             //0
  kal_bool      add_qos_when_offer_present;            //0
  kal_uint8     call_normal_clear_timer_timeout;       //0
  kal_bool      no_state_transition_when_183_withoutsdp;//0
  kal_bool      use_org_nego_codec;                    //0
  kal_uint8     set_upgrade_des_strength_optional;     //0
  kal_uint8     UA_call_evs_mode_set[20];              // string: 0,1,2,3,4,5,6,7,8
  kal_uint8     wfc_emerg_pidf_lng_lat_country;        //0
  kal_uint8     ringing_state_oos_level;               //0
  kal_uint8     use_pau_at_sdp_origin;                 //0
  kal_uint8     p_early_media_in_invite;               //0
  kal_uint8     ect_refer_to_use_pai;                  //0
  kal_uint8     ect_refer_to_use_sip_uri;              //0
  kal_uint8     omit_err_rsp_for_prack;                //1
  kal_uint8     esipcpi_full_reason;                   //0
  kal_uint8     check_380_xml_with_no_action;          //0
  kal_uint8     bypass_380_pai_check;                  //0
  kal_uint8     set_non_sendrecv_rtcp_0;               // 0
  kal_uint8     conf_refer_order_by_call_id;           // 0
  kal_uint32    mo_b1_timer_timeout;                   // 0
  kal_uint8     follow_mt_pt_list;                     // 0
  kal_uint8     hold_unhold_send_eimscmode;            //0
  kal_uint32    mt_call_last_come_first_served_timer_timeout;    // 0
  kal_uint8     wait_user_end_call;                    //0
  kal_uint8     always_fetch_1st_entry_in_hisInfo;     //0
  kal_uint8     pending_sip_msg_in_oos_state;          // 1
  kal_uint8     follow_dir_conf_refer_to;              // 0
  kal_uint8     rm_prcd_when_video_prcd_off;           // 0
  kal_uint8     regard_180_without_pem_as_inactive;    //0
  kal_uint8     rm_civic_on_e911;                      //0
  kal_uint8     mod_session_req_timer_timeout;         //40
  kal_bool      delay_ecpi2_at_183;                    //0
  kal_uint8     t311_expired_release_call;             //0
  kal_bool      add_199_feature_tag;                   //0
  kal_uint8     wait_user_end_call_no_rtppkt;          //0
  kal_uint8     video_tag_for_all_calls;               //0
  kal_uint8     send_183_without_sdp_when_no_100rel;   //0
  kal_uint8     reset_tcp_when_tcall_timeout;          //0
  kal_uint8     sdp_group_rtpmap_fmtp;                 //0
  kal_uint8     sdp_group_rtpmap_ptime;                //1
  kal_uint8     accept_wifi_call_if_audio_cap_0;       //0
  kal_uint8     send_ecpi2_after_200ok_prack;          //0
  kal_uint8     add_pani_in_ack;                       //0
  kal_uint8     ect_block_in_remote_hold;              //0
  kal_uint8     ect_delay_target_unhold;               //0


  /* SMS */
  kal_uint8     psismsc_from_user;              // 0
  kal_uint8     force_psi_scheme_to_tel;        // 0
  kal_uint8     add_user_phone;                 // 1
  kal_uint8     update_call_id_with_host;       // 0
  kal_uint8     add_no_fork_in_SMS;             // 0
  kal_uint8     nsn_specific;                   // 0
  kal_uint8     mo_retry_after_504;             // 0
  kal_uint8     send_timerF_expiry;             // 0
  kal_uint8     imsi_reged_disable_sms;         // 0
  kal_uint8     sms_network_types;              // bitmap: bit 0: LTE, default 1
                                                //         bit 1: WiFi default 1
  kal_uint8     sms_support_in_23g;             // 1
  kal_uint8     sms_follow_nw_ims_vops_support; // 0
  kal_bool      restore_in_3gpp_abnormal;       // 1
  kal_uint8     in_reply_to_support;            // 1

  /* Registration */
  kal_uint32    keep_alive_mode;                // 0
  kal_uint32    tcp_connect_max_time_invite;    // 10
  kal_int32     retry_interval_after_403;       // 0
  kal_uint8     contact_with_username;          // 1
  kal_uint8     contact_with_transport;         // 0
  kal_uint8     contact_with_regid;             // 0
  kal_uint8     contact_with_mobility;          // 0
  kal_uint8     contact_with_expires;           // 0
  kal_uint8     authorization_with_algo;        // 0
  kal_uint8     rereg_in_rat_change;            // 0
  kal_uint8     rereg_in_oos_end;               // 0
  kal_uint8     de_subscribe;                   // 1
  kal_uint8     use_specific_ipsec_algo;        // 0
  kal_uint8     try_next_pcscf;                 // 0
  kal_uint8     dereg_clear_ipsec;              // 0
  kal_uint8     initial_reg_without_pani;       // 0
  kal_uint8     dereg_reset_tcp_client;         // 0
  kal_uint8     treg;                           // 0
  kal_uint8     rereg_23g4;                     // 0
  kal_uint8     resub_23g4;                     // 0
  kal_uint8     not_auto_reg_403;               // 0
  kal_uint8     call_id_with_host_inReg;        // 0
  kal_uint8     ems_mode_ind;                   // 0
  kal_uint8     contact_with_accesstype;        // 0
  kal_uint8     wfc_with_plani;                 // 0
  kal_uint8     use_udp_on_tcp_fail;            // 1
  kal_uint8     ipsec_fail_allowed;             // 1
  kal_uint8     contact_with_video_feature_tag_in_subscribe;    // 0
  kal_uint8     via_without_rport;              // 0
  kal_uint8     reg_route_hdr;                  // 0
  kal_uint8     via_uri_with_default_port;      // 0
  kal_uint8     notify_sms_notify_done;         // 0
  kal_uint8     emergency_use_imsi;             // 0
  kal_uint8     check_msisdn;                   // 0
  kal_uint8     support_throttling_algo;        // 0
  kal_uint8     reg_after_nw_dereg_60s;         // 0
  kal_uint8     sub_contact_with_sip_instance;  // 0
  kal_uint8     stop_reg_md_lower_layer_err;    // 0
  kal_uint8     reg_gruu_support;               // 1
  kal_uint8     oos_end_reset_tcp_client;       // 0
  kal_uint8     wfc_refresh_23g;                // 0
  kal_uint8     pidf_country;                   // 0
  kal_uint8     init_reg_backoff_enabled;       // 0
  kal_uint8     reg_fail_not_need_remove_binding;           // 1
  kal_uint8     pend_dereg_in_initial_reg;      // 0
  kal_uint8     access_network_info_type;       // 0
  kal_uint8     when_stop_b_timer;              // 100
  kal_uint8     rcs_feature[12];                // 0
  kal_uint8     try_next_pcscf_5626;            // 0
  kal_uint8     try_same_pcscf_rereg;           // 0
  kal_uint8     reg_try_all_pcscf_5626;         // 0
  kal_uint8     close_unprotected_conn;         // 0
  kal_uint8     need_revise_rtp_dir;            // 0
  kal_uint8     calc_participant_count_from_notify;  //0
  kal_uint8     dereg_send_bye;                 // 0
  kal_uint32    tdelay;                         // 5
  kal_uint32    try_n_next_pcscf_5626;          // 0
  kal_uint32    dereg_delay_time;               // 0
  kal_uint8     try_same_pcscf_if_retry_after;  // 0
  kal_uint8     contact_wildcard_dereg;         // 0
  kal_uint8     check_notify_instance_id;       // 0
  kal_uint8     add_cs_volte_feature_tag;       // 0
  kal_uint8     check_call_domain;              // 0
  kal_uint8     support_sip_block;              // 0
  kal_uint8     sip_compact_headers;            // 0
  kal_uint8     support_resub;                  // 1
  kal_uint32    expire_time_by_user;            // 0
  kal_uint8     reg_over_tcp;                   // 0
  kal_uint32    not_auto_reg;                   // bitmap: bit 0: 500 registration failure response received, default 0
                                                //         bit 1: 503 registration failure response received, default 0
                                                //         bit 2: TBD
  kal_uint32    emc_cits_protect_timer;         // 0
  kal_uint8     random_init_ipsec_port;         // 1
  kal_uint8     add_cell_info_age_to_cni;       // 0
  kal_uint8     check_reg_contact;              // 1
  kal_uint8     geolocation_type;               // 0
  kal_uint32    init_reg_delay_time;            // 0
  kal_uint8     add_timezone_to_pani;           // 0
  kal_uint32    tcp_connect_max_time_all;       // 0 
  kal_uint8     update_ipsec_port_494;          // 1
  kal_uint8     rtt_tag_mode;                   // 0
  kal_uint32    reject_rcs_request;             // 0
  kal_uint32    reuse_transport_methods;        // 0x00000050 (ACK + CANCEL)
  kal_bool      reg_check_reason_header;        // 0
  kal_uint8     default_reg_retry_mechanism;    // 1
  kal_uint32    last_known_rat_type;            // 0
  kal_uint8     last_known_cell_id[64];         // 0
  kal_uint8     last_known_cell_timestamp[32];  // 0
  kal_uint8     update_cap_when_rat_net_change; // 1
  kal_uint8     from_header_peer_addr;          // 2
  kal_uint8     call_tcw_timer_timeout;         // 0
  kal_uint32    sub_def_expires;                // 0
  kal_uint8     support_combine_retry_algo;     // 0
  kal_uint8     release_pdn_when_ems_dereg;     // 1
  kal_uint8     add_phone_context_ignore_number_type; //0
  kal_uint8     ims_notify_feature_enabled;     // 0
  kal_bool      query_other_sim_call_state;     // 0  
  kal_uint8     check_roam_vops;                // 1
  kal_uint8     reged_with_notification;        // 0
  kal_uint32    reg_add_content_disposition;    // 0
  kal_uint8     reg_disable_pidf;               // 0
  kal_uint8     delay_normal_or_em_reg_if_they_occur_simulta;    // 0
  kal_uint8     dynamic_pdn_mtu;    // 0
  kal_uint8     reg_first_check_retry_after_header;    // 0
  kal_uint8     try_next_pcscf_5626_cycle;      // 0
  kal_uint8     reg_retry_after_ct_403;         // 0
  kal_uint8     register_no_response_ct;        // 0
  kal_uint8     report_eimsreginfo_urc;         // 0
  kal_bool      open_pcscf_retry_count_limit;   // 0
  kal_uint8     reg_reset_normal_tcp;           // 0
  kal_uint8     pcscf_usage_for_last_pcscf;     // 0
  kal_uint8     bypass_403_reason_phrase;       // 0
  kal_uint8     rereg_request_hps_support;      // 0
  kal_uint8     conf_call_final_notify_timer_timeout; //0
  kal_uint8     add_param_in_rm_prtcpnt;        //0
} nvram_ua_struct;

typedef struct{
  /* TO IMCB */
  kal_uint32    resouce_retain_timer;                 // 3000ms
  kal_uint32    emergency_pdn_retain_timer;           // 10000ms
  kal_uint32    auto_re_reg_timer;                    // 5    000ms
  kal_uint32    auto_re_reg_base_timer;               // 30   000ms
  kal_uint32    auto_re_reg_max_timer;                // 1800 000ms
  kal_uint32    poweroff_detach_timer;                // 0?
  kal_uint32    poweroff_ims_dereg_timer;             // 0?
  kal_uint32    emergency_reg_retain_timer;           // 10s, in ms
  kal_uint32    ims_rel_cs_semaphore_timer;           // 5s
  kal_uint32    ims_re_reg_sub_rel_semaphore_timer;   // 2s
  kal_uint8     pcscf_priority_list[8];               // reference enum in imcb_imc_struct.h
  kal_uint8     set_pcscf_discovery_via_nas;          // 1 (default set the flag)
  kal_uint8     voice_bearer_ctrl;                    // 0: Use dedicated bearer, 1: Use signalling bearer, 2: force to signalling bearer
  kal_uint8     default_pcscf_address_is_v4;          // 0:v6, 1:v4
  kal_uint8     force_user_accout_by_manual;          // 0 (default is derived IMPI/IMPU/Domain Name from ISIM: 0)
  kal_uint8     set_ue_im_cn_signaling_flag;          // 1 (default set the flag)
  kal_uint8     check_nw_im_cn_signaling_flag;        // 0 (default not check)
  kal_uint8     ims_signaling_qci;                    // 5
  kal_uint8     ims_voice_qci;                        // 1
  kal_uint8     ims_video_qci;                        // 2
  kal_uint16    ims_text_qci;                         // 255
  kal_uint8     ims_v4v6_preference;                  // 0=v4_only, 1=v6_only, 2=v4_prefer, 3=v6_prefer, default 3
  kal_uint32    rel_hps_threshold;                    // 40
  /* pcscf_manual_list?? */
  kal_bool      pcscf_manual_support;                 // 0
  kal_bool      pcscf_mo_support;                     // 0
  kal_bool      pcscf_sim_support;                    // 1
  kal_bool      pcscf_pco_renew_support;              // 1
  /* IMC internal used */
  kal_bool      emergency_call_learning_support;      // 1
  kal_bool      home_detected_emergency_call_support; // 1
  kal_bool      sms_support;                          // 0
  kal_bool      voice_support;                        // 0
  kal_bool      wifi_voice_support;                   // 0
  kal_bool      video_over_ps_support;                // 0
  kal_bool      wifi_video_over_ps_support;           // 0
  kal_bool      ussd_support;                         // 0
  kal_uint8     resource_allocation_mode;             // 0  (NW initial:0, UE initial: 1)
  kal_uint8     icsi_resource_allocation_mode_1;      // 0
  kal_uint8     icsi_resource_allocation_mode_2;      // 0
  kal_uint8     icsi_resource_allocation_mode_3;      // 0

  kal_uint8     icsi_resource_allocation_mode_4;      // 0
  kal_uint8     ims_roaming_mode;                     // 0 (0: disable, 1: enable, 2: auto)
  kal_bool      mncmcc_pass_flag;                     //enable mnc,mcc check for registration
  kal_uint8     ims_reg_allowed_at_23g;               // 0 (0: not allow, 1: allow and maintain, 2: maintain only)
  kal_uint8     unsync_cfg;                           // 1 (0:none 1:yellow screen)
  kal_uint8     wifi_em_reg_by_em_pdn;                // 0
  kal_uint8     allow_emergency_dereg;                // 0 (0: disable, 1: enable, 2: deactivate emergency PDN directly)
  kal_uint8     manual_cell_id[64];                  // 0
  kal_uint8     pcscf_manual_list[16];               // default pcscsf address, 192.168.0.1
  kal_uint8     default_psismsc[64];                 // sip:smsc@ims.mnc001.mcc001.3gppnetwork.org
  kal_uint8     manual_impi[64];                     // 310886000000042@ims.mnc688.mcc310.3gppnetwork.org
  kal_uint8     manual_impu[64];                     // sip:+18860000042@srnims3.srnnam.nsn-rdnet.net
  kal_uint8     manual_domain_name[64];              // srnims3.srnnam.nsn-rdnet.net
  kal_uint8     mncmcc_whitelist[128];              //mnc,mcc whitelist for operator <dig><num><mnc_len><MNC><mcc_len><MCC>

  kal_uint8     nw_vops_rule;                         // 0
  kal_uint8     location_info_support;                // 0
  kal_uint8     loc_info_query_timer;                 // 20
  kal_uint8     loc_info_refresh_timer;               // 10
  kal_uint8     ecc_guard_timer;                      // 10s
  kal_bool      disable_isim_application;             // 0
  kal_bool      open_volte_cc;                        // 0
  kal_bool      rfc5626_flow_recovery;                // 0
  kal_uint8     ims_estab_timer;                      // 120s
  kal_uint8     switch_prefer_rat_dereg;              // 0
  kal_bool      no_ims_reg_during_active_cs_call;     // 0
  kal_bool      srvcc_no_ims_dereg_until_call_rel;    // 0
  kal_bool      att_family;                           // 0
  kal_bool      impu_change_dereg;                    // 0
  kal_bool      emc_dereg_while_volte_off;            // 0
  kal_uint8     max_RFC5626_retry_count_403;          // 1
  kal_uint8     unlock_ims_permanent_reg_receive_tau; // 0
  kal_uint8     unlock_ims_reg_after_volte_reenable;  // 0
  kal_uint8     max_retry_limit_486;                  // 0xff
  kal_uint8     ims_sleep_mode_retry_support;         //0
  kal_uint32    emergency_call_category_mapping;      //0
  kal_bool      block_reg_when_isim_params_no_avail;  //0
  kal_bool      block_reg_when_isim_no_avail;         //0
  kal_bool      reject_e911_when_no_voice_cap;        //0

  /* Extend IMCB internal config to NVRAM */
  kal_uint8     ignore_sgn_qci_check;               // 0
  kal_uint32     ignore_media_qos_check;             // 0
  kal_uint8     default_fallback_support;           // 0
  kal_uint8     dedicated_fallback_support;         // 0
  kal_uint8     restore_pcscf;                      // 0
  kal_uint8     not_acquire_audio_rtcp;             // 0
  kal_uint8     not_acquire_video_rtcp;             // 0
  kal_uint8     silent_deact;                       // 0
  kal_uint8     imcb_setting_string[64];            // ""
  kal_uint8     pcscf_home_policy_list[32];         // {0,2,1,4,5,3,6,0}
  kal_uint8     pcscf_visit_policy_list[32];        // {0,2,1,4,5,3,6,0}
  kal_uint8     sgn_selection_weight[16];           // {4,2,1}
  kal_bool      silent_pdn_deact;                   // 0
  kal_uint32    dereg_defer_pdn_release_timer;      // 0
  kal_bool      timerF_expiry;                      // 0
  kal_bool      timerB_expiry;                      // 0
  kal_uint8     pdn_rej_handle[64];                 // N,*,0,1;E,*,0,1
  kal_uint32    video_resource_retain_timer;        // 0
  kal_uint8     video_default_fallback_support;     // 0
  kal_bool      enable_audio_precondition;          // 0
  kal_bool      enable_video_precondition;          // 0
  kal_uint8     video_dedicated_fallback_support;   // 0
  kal_uint8     normal_pdn_retry_count;             // 10
  kal_uint32    ext_timer_config[2];                // {0,0}
  kal_uint32    reset_retry_after_timer_criteria;   // 0
  kal_uint8     not_decouple_dereg_and_pdn_deact;   // 0
  kal_uint32    e911_resource_retain_timer;         // 0
  kal_uint8     empty_pcscf_list_fail_cause;        // 0
  kal_uint8     bearer_matching_preference;         // 0
  kal_uint32    pdn_retry_pre_backoff_count;        // 3
  kal_uint32    pdn_retry_base_time;                // 1
  kal_uint32    pdn_retry_max_time;                 // 900
  kal_uint8     pdn_retry_backoff_enable;           // 0
  kal_bool      enable_ddd_feature;                 // 0
  kal_uint32    wait_for_sgn_timer;                 // 5
  kal_bool      rel_emc_pdn_afr_timer_expr;         // 0
  kal_uint32    ignore_media_qci_check;             // 0
  kal_bool      ecc_use_normal_pcscf;               // 0
  kal_uint32     audio_bearer_lost_retain_timer;    // 0
  kal_uint32     video_bearer_lost_retain_timer;    // 0
  kal_uint32     text_bearer_lost_retain_timer;     // 0
  kal_uint32    detach_reattach_backoff_timer;
  kal_uint8     pcscf_reselect_flag;                //0
  kal_uint8     ims_cs_rf_guard_timer_extend_support; // 0
  kal_uint8     text_default_fallback_support;      //0
} nvram_imc_struct;

typedef struct{
  nvram_ua_struct   ua_config;
  nvram_imc_struct  imc_config;
} nvram_ef_ims_profile_record_struct;

typedef struct{
  kal_uint32 pvs_setting_mask[2];
