/*****************************************************************************
*  Copyright Statement:
*  --------------------
*  This software is protected by Copyright and the information contained
*  herein is confidential. The software may not be copied and the information
*  contained herein may not be used or disclosed except with the written
*  permission of MediaTek Inc. (C) 2016
*
*  BY OPENING THIS FILE, BUYER HEREBY UNEQUIVOCALLY ACKNOWLEDGES AND AGREES
*  THAT THE SOFTWARE/FIRMWARE AND ITS DOCUMENTATIONS (""MEDIATEK SOFTWARE"")
*  RECEIVED FROM MEDIATEK AND/OR ITS REPRESENTATIVES ARE PROVIDED TO BUYER ON
*  AN ""AS-IS"" BASIS ONLY. MEDIATEK EXPRESSLY DISCLAIMS ANY AND ALL WARRANTIES,
*  EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF
*  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NONINFRINGEMENT.
*  NEITHER DOES MEDIATEK PROVIDE ANY WARRANTY WHATSOEVER WITH RESPECT TO THE
*  SOFTWARE OF ANY THIRD PARTY WHICH MAY BE USED BY, INCORPORATED IN, OR
*  SUPPLIED WITH THE MEDIATEK SOFTWARE, AND BUYER AGREES TO LOOK ONLY TO SUCH
*  THIRD PARTY FOR ANY WARRANTY CLAIM RELATING THERETO. MEDIATEK SHALL ALSO
*  NOT BE RESPONSIBLE FOR ANY MEDIATEK SOFTWARE RELEASES MADE TO BUYER'S
*  SPECIFICATION OR TO CONFORM TO A PARTICULAR STANDARD OR OPEN FORUM.
*
*  BUYER'S SOLE AND EXCLUSIVE REMEDY AND MEDIATEK'S ENTIRE AND CUMULATIVE
*  LIABILITY WITH RESPECT TO THE MEDIATEK SOFTWARE RELEASED HEREUNDER WILL BE,

----------------------------------------------------------------------------*/
typedef enum /*_Message_ID_define*/
{
    RCP_TST_TX_CDMA_CTRL_MSG,

    /* RTM Test Msgs */
    RTM_TEST_CFG_MSG,
    RTM_TEST_MBPMACBITSOUTPUT_MSG,
    RTM_TEST_MFCGRANTCAL23_MSG,
    RTM_TEST_PARM_GET_MSG,
    RTM_TEST_PARM_SET_MSG,
    RTM_TEST_TXCHANSTAT_GET_MSG,

    /* ACM Test Msgs */
    ACM_TEST_CFG_MSG,
    ACM_TEST_ACACK_MSG,

    /* PHY CHAN Test Msgs */
    RCP_PHY_ACH_TEST_MSG,
    RCP_PHY_TCH0_TEST_MSG,
    RCP_PHY_TCH2_TEST_MSG,
    RCP_TXDMA_TEST_CFG_MSG,
    RCP_TXDMA_TEST_START_MSG,
    RCP_TXDMA_TEST_READ_MSG,
    RCP_PHY_TCH_TEST_DATA_WRITE_MSG,
    RCP_PACKET_PERF_STAT_RESET_MSG,
    RCP_RTM_QOS_TXMODE_SELECTION_MSG,

    /* CpBuf Test Msgs */
    SYS_CPBUF_TEST_GET_CMD_MSG,
    SYS_CPBUF_TEST_FREE_CMD_MSG,
    SYS_CPBUF_TEST_STATS_CMD_MSG,

    TAP_TEST_INIT_MSG,
    TAP_CONN_CLOSE_MSG,

    FTAP_TEST_INIT_MSG,
    FTAP_CONN_CLOSE_MSG,

    ETS_SET_STRAPP_MSG,
    ETS_MFPA_SET_SIMPLE_ATTR,
    ETS_MFPA_SET_FlowNNIdentification_Attr,
    ETS_MFPA_SET_FlowNNReservation_Attr,
    ETS_MFPA_SET_FlowNNTimers_Attr,
    ETS_MFPA_SET_SupportedHLProtocols_Attr,
    ETS_MFPA_SET_ATSupportedQoSProfiles_Attr,
    ETS_MFPA_READ_SUBSCRIB_QOS_PROFILE,
    ETS_MFPA_IPFlow_Request_Attr,
    ETS_MFPA_SET_CURLABEL_Attr,
    ETS_MFPA_Delete_Flow,
    ETS_MFPA_PPP_OPEN,
    ETS_MFPA_RLP_STAT_RESET_MSG,
    ETS_MFPA_RLP_STAT_PEEK_MSG,
    ETS_MFPA_SEND_DOS_MSG,

    ETS_DSAR_MSG_BLK_MSG,
    RCP_TEST_MSG_MSGID_LAST

} RcpTestMsgT;

/* DecodeMessageResult*/
typedef enum
{
   RCP_DECODE_MSG_OK,
   RCP_DECODE_MSG_DUP,  /*duplicate message, discard but not print error*/
   RCP_DECODE_MSG_ERROR
} RcpDecodeMsgResultE;

/*----------------------------------------------------------------------------
     define signals used by RCP task
----------------------------------------------------------------------------*/
#define RCP_CMD_MAILBOX_EVENT           EXE_MESSAGE_MBOX_1   /* EXE_MAILBOX_1 */
#define RCP_DATA_MAILBOX_EVENT          EXE_MESSAGE_MBOX_2   /* EXE_MAILBOX_2 */
#define RCP_OTAMSG_MAILBOX_EVENT        EXE_MESSAGE_MBOX_3   /* EXE_MAILBOX_3 */
#define RCP_TEST_MAILBOX_EVENT          EXE_MESSAGE_MBOX_4   /* EXE_MAILBOX_4 */

/*----------------------------------------------------------------------------
     Message Formats structure
----------------------------------------------------------------------------*/
/** Define TX Calibration Type */
typedef enum
{
   RCP_SIG_TYPE_PILOT = 0,
   RCP_SIG_TYPE_ST2,
   RCP_SIG_TYPE_PHYUT
}RcpTstSigTypeT;

/** define the command action enumeration */
typedef enum
{
    RCP_ACTION_OFF,
    RCP_ACTION_ON
} RcpTstActionT;

/* RCP_ETS_TX_AVAILABLE_PWR_TEST_MODE_MSG*/
typedef enum
{
   TX_AVAILABLE_PWR_NORMAL_MODE = 0,
   TX_AVAILABLE_PWR_NO_ACK_MODE,
   TX_AVAILABLE_PWR_NO_ACK_DSC_MODE
} RcpTxAvailPwrTestModeT;

/* RCP_ETS_SET_HW_TRIGGER_MSG*/
typedef PACKED_PREFIX struct
{
   kal_uint8    Trigger;  /* Disable, Access, Traffic*/
   kal_uint8    FrameDelay;
   kal_uint16   LongCodeMIL0;  /* non-zero is for long code mask override*/
   kal_uint16   LongCodeMIL1;
   kal_uint16   LongCodeMIH0;
} PACKED_POSTFIX  RcpEtsSetHwTriggerMsgT;

/* HW trigger type */
typedef enum
{
   HW_TRIGGER_DISABLE=0,
   HW_TRIGGER_ACCESS,
   HW_TRIGGER_TRAFFIC
} RcpHwTriggerT;

/* array size for long code mask */
#define RCP_LONG_CODE_MASK_SIZE     6

typedef PACKED_PREFIX struct
{
    kal_uint16 frameOffset;
    kal_uint16 prePilotScale;         /* 9,3,u */
    kal_uint16 pilotScale;              /* 9,3,u */
    kal_uint16 rriDataAck0;           /* Access Rate 1:9.6k, 2:19.2k, 3:38.4k */
    kal_uint16 dataScale0Ack;       /* 11,6,u */
    kal_uint16 sDScale1;               /* 4,3,t */
    kal_uint16 sDScale2;               /* 4,3,t */
    kal_uint32 frameData[32];       /* 2 frame data 512 bits */
    kal_uint16 bbCaptureFrame;
    kal_uint16 testCase;
} PACKED_POSTFIX RcpPhyAchTestMsgT;

typedef PACKED_PREFIX struct
{
    kal_uint16 pilotScale;              /* 9,3,u */
    kal_uint16 dRCGating;
    kal_uint16 dRCLen;
    kal_uint16 dRCScale;
    kal_uint16 ackSUPScale;
    kal_uint16 ackMUPScale;
    kal_uint16 rriDataAck1[4];           /* Access Rate 1:9.6k, 2:19.2k, 3:38.4k */
    kal_uint16 dataScale0Ack[4];       /* 11,6,u per frame */
    kal_uint16 sDScale1[4];               /* 4,3,t */
    kal_uint16 sDScale2[4];               /* 4,3,t */
    kal_uint16 dRCCover;
    kal_uint16 dRCValue;
    kal_uint16 rRIScaleAck;
    kal_uint16 bbCaptureFrame;
    kal_uint16 testCase;
} PACKED_POSTFIX RcpPhyTch01TestMsgT;

typedef PACKED_PREFIX struct
{
    kal_uint16 pilotScale;              /* 9,3,u */
    kal_uint16 dRCGating;
    kal_uint16 dRCLen;
    kal_uint16 dRCScale;
    kal_uint16 ackSUPScale;
    kal_uint16 ackMUPScale;
    kal_uint16 rriDataAck2[12];
    kal_uint16 rriDataNak2[12];
    kal_uint16 dataScale0Ack[12];       /* 11,6,u per frame */
    kal_uint16 dataScale0Nak[12];       /* 11,6,u per frame */
    kal_uint16 dataScale1Ack[12];       /* 11,6,u per frame */
    kal_uint16 dataScale1Nak[12];       /* 11,6,u per frame */
    kal_uint16 dataScale2Ack[12];       /* 11,6,u per frame */
    kal_uint16 dataScale2Nak[12];       /* 11,6,u per frame */
    kal_uint16 dataScale3Ack[12];       /* 11,6,u per frame */
    kal_uint16 dataScale3Nak[12];       /* 11,6,u per frame */
    kal_uint16 dataScaleAck[12];       /* 11,6,u per frame */
    kal_uint16 revAckData[12];
    kal_uint16 twoBitAckNak[12];
    kal_uint16 dRCLenBoost[12];
    kal_uint16 dSCLenBoost[12];
    kal_uint16 fwdAckData[48];
    kal_uint16 rRIScaleAck;
    kal_uint16 rRIScaleNak;
    kal_uint16 dSCScale;
    kal_uint16 dRCScaleBoost;
    kal_uint16 dSCScaleBoost;
    kal_uint16 auxPilotMinPayload;
    kal_uint16 auxPilotScale;
    kal_uint16 bbCaptureFrame;
    kal_uint16 testCase;
} PACKED_POSTFIX RcpPhyTch2TestMsgT;

typedef PACKED_PREFIX struct
{
    kal_uint32 offsetAddr;
    kal_uint32 dataLen;
    kal_uint32 testData[128];
} PACKED_POSTFIX RcpPhyTch01TestDataWriteMsgT;

typedef PACKED_PREFIX struct
{
    kal_uint32  lldAddress;
    kal_uint32  srcAddress;
    kal_uint32  destAddress;
    kal_uint32  nextLldAddress;
    kal_uint8   srcData[32];
    kal_uint16  dataLen;
    kal_uint16  ackNak;
    kal_uint16  firstLld;
    kal_uint16  width;
