#ifndef __CUIF_LTE_RX_SF_CC_CMD_H__
#define __CUIF_LTE_RX_SF_CC_CMD_H__

// ----------------- CUIF_LTE_RX_SF_CC_CMD Register Definition -------------------
typedef volatile struct {
    kal_uint32 CC_INFO0;                                                                  // 0x0000
    kal_uint32 CC_INFO1;                                                                  // 0x0004
    kal_uint32 TIME_INFO0[2];                                                             // 0x0008..0x000C
    kal_uint32 TIME_INFO1[2];                                                             // 0x0010..0x0014
    kal_uint32 LOW_POW_CTRL;                                                              // 0x0018
    kal_uint32 MOD_EN;                                                                    // 0x001C
    kal_uint32 RST_SCENARIO;                                                              // 0x0020
    kal_uint32 AFC_INFO0;                                                                 // 0x0024
    kal_uint32 AFC_INFO1;                                                                 // 0x0028
    kal_uint32 AFC_INFO2;                                                                 // 0x002C
    kal_uint32 AFC_INFO3;                                                                 // 0x0030
    kal_uint32 DUMP_BITMAP_INFO;                                                          // 0x0034
    kal_uint32 MIB_COMM_INFO;                                                             // 0x0038
    kal_uint32 BRP_INFO0;                                                                 // 0x003C
    kal_uint32 BRP_INFO1;                                                                 // 0x0040
    kal_uint32 BRP_INFO;                                                                  // 0x0044
    kal_uint32 RRM_INFO;                                                                  // 0x0048
    kal_uint32 PI_INFO;                                                                   // 0x004C
    kal_uint32 SIB_INFO;                                                                  // 0x0050
    kal_uint32 NBI_SPUR_IDX_RX0_0;                                                        // 0x0054
    kal_uint32 NBI_SPUR_IDX_RX0_1;                                                        // 0x0058
    kal_uint32 NBI_SPUR_IDX_RX1_0;                                                        // 0x005C
    kal_uint32 NBI_SPUR_IDX_RX1_1;                                                        // 0x0060
    kal_uint32 SRV_INFO0;                                                                 // 0x0064
    kal_uint32 SRV_INFO1;                                                                 // 0x0068
    kal_uint32 SRV_INFO2;                                                                 // 0x006C
    kal_uint32 CSI_CTRL;                                                                  // 0x0070
    kal_uint32 CSI_CC_INFO;                                                               // 0x0074
    kal_uint32 PMI_CONFIRM_INFO0;                                                         // 0x0078
    kal_uint32 PMI_CONFIRM_INFO1;                                                         // 0x007C
    kal_uint32 PMI_CONFIRM_INFO2;                                                         // 0x0080
    kal_uint32 PMI_CONFIRM_INFO3;                                                         // 0x0084
    kal_uint32 HST_INFO0;                                                                 // 0x0088
    kal_uint32 RX_SINR_ITF;                                                               // 0x008C
    kal_uint32 BRP_RESERVED_1;                                                            // 0x0090
    kal_uint32 CRSNE_CTRL_INFO_0;                                                         // 0x0094
    kal_uint32 F4L_PATCH_INFO;                                                            // 0x0098
} CUIF_LTE_RX_SF_CC_CMD_REGS, *PCUIF_LTE_RX_SF_CC_CMD_REGS;

// ---------- CUIF_LTE_RX_SF_CC_CMD word-offset  ----------
#define O_CUIF_LTE_RX_SF_CC_CMD_CC_INFO0                                                  (0)
#define O_CUIF_LTE_RX_SF_CC_CMD_CC_INFO1                                                  (1)
#define O_CUIF_LTE_RX_SF_CC_CMD_TIME_INFO0(i)                                             (2 + (i))
#define O_CUIF_LTE_RX_SF_CC_CMD_TIME_INFO1(i)                                             (4 + (i))
#define O_CUIF_LTE_RX_SF_CC_CMD_LOW_POW_CTRL                                              (6)
#define O_CUIF_LTE_RX_SF_CC_CMD_MOD_EN                                                    (7)
#define O_CUIF_LTE_RX_SF_CC_CMD_RST_SCENARIO                                              (8)
#define O_CUIF_LTE_RX_SF_CC_CMD_AFC_INFO0                                                 (9)
