#ifndef __CUIF_LTE_NCM_CC_RPT_H__
#define __CUIF_LTE_NCM_CC_RPT_H__

// ----------------- CUIF_LTE_NCM_CC_RPT Register Definition -------------------
typedef volatile struct {
    kal_uint32 INFO[12];                                                                  // 0x0000..0x002C
    kal_uint32 GDE_TIME_OFFSET[6];                                                        // 0x0030..0x0044
    kal_uint32 IIR[12];                                                                   // 0x0048..0x0074
    kal_uint32 GDE_MAN_P0_CELL0;                                                          // 0x0078
    kal_uint32 GDE_MAN_P1_CELL0;                                                          // 0x007C
    kal_uint32 GDE_EXP_CELL0;                                                             // 0x0080
    kal_uint32 GDE_MAN_P0_CELL1;                                                          // 0x0084
    kal_uint32 GDE_MAN_P1_CELL1;                                                          // 0x0088
    kal_uint32 GDE_EXP_CELL1;                                                             // 0x008C
    kal_uint32 GDE_MAN_P0_CELL2;                                                          // 0x0090
    kal_uint32 GDE_MAN_P1_CELL2;                                                          // 0x0094
    kal_uint32 GDE_EXP_CELL2;                                                             // 0x0098
    kal_uint32 GDE_MAN_P0_CELL3;                                                          // 0x009C
    kal_uint32 GDE_MAN_P1_CELL3;                                                          // 0x00A0
    kal_uint32 GDE_EXP_CELL3;                                                             // 0x00A4
    kal_uint32 GDE_MAN_P0_CELL4;                                                          // 0x00A8
    kal_uint32 GDE_MAN_P1_CELL4;                                                          // 0x00AC
    kal_uint32 GDE_EXP_CELL4;                                                             // 0x00B0
    kal_uint32 GDE_MAN_P0_CELL5;                                                          // 0x00B4
    kal_uint32 GDE_MAN_P1_CELL5;                                                          // 0x00B8
    kal_uint32 GDE_EXP_CELL5;                                                             // 0x00BC
    kal_uint32 GDE_MAN_P0_CELL6;                                                          // 0x00C0
    kal_uint32 GDE_MAN_P1_CELL6;                                                          // 0x00C4
    kal_uint32 GDE_EXP_CELL6;                                                             // 0x00C8
    kal_uint32 GDE_MAN_P0_CELL7;                                                          // 0x00CC
    kal_uint32 GDE_MAN_P1_CELL7;                                                          // 0x00D0
    kal_uint32 GDE_EXP_CELL7;                                                             // 0x00D4
    kal_uint32 GDE_MAN_P0_CELL8;                                                          // 0x00D8
    kal_uint32 GDE_MAN_P1_CELL8;                                                          // 0x00DC
    kal_uint32 GDE_EXP_CELL8;                                                             // 0x00E0
    kal_uint32 GDE_MAN_P0_CELL9;                                                          // 0x00E4
    kal_uint32 GDE_MAN_P1_CELL9;                                                          // 0x00E8
    kal_uint32 GDE_EXP_CELL9;                                                             // 0x00EC
    kal_uint32 GDE_MAN_P0_CELL10;                                                         // 0x00F0
    kal_uint32 GDE_MAN_P1_CELL10;                                                         // 0x00F4
    kal_uint32 GDE_EXP_CELL10;                                                            // 0x00F8
    kal_uint32 GDE_MAN_P0_CELL11;                                                         // 0x00FC
    kal_uint32 GDE_MAN_P1_CELL11;                                                         // 0x0100
    kal_uint32 GDE_EXP_CELL11;                                                            // 0x0104
    kal_uint32 RSSI_MAN_RX0_CELL0;                                                        // 0x0108
    kal_uint32 RSSI_MAN_RX1_CELL0;                                                        // 0x010C
    kal_uint32 RSSI_EXP_CELL0;                                                            // 0x0110
    kal_uint32 RSSI_MAN_RX0_CELL1;                                                        // 0x0114
    kal_uint32 RSSI_MAN_RX1_CELL1;                                                        // 0x0118
    kal_uint32 RSSI_EXP_CELL1;                                                            // 0x011C
    kal_uint32 RSSI_MAN_RX0_CELL2;                                                        // 0x0120
    kal_uint32 RSSI_MAN_RX1_CELL2;                                                        // 0x0124
    kal_uint32 RSSI_EXP_CELL2;                                                            // 0x0128
    kal_uint32 RSSI_MAN_RX0_CELL3;                                                        // 0x012C
    kal_uint32 RSSI_MAN_RX1_CELL3;                                                        // 0x0130
    kal_uint32 RSSI_EXP_CELL3;                                                            // 0x0134
    kal_uint32 RSSI_MAN_RX0_CELL4;                                                        // 0x0138
    kal_uint32 RSSI_MAN_RX1_CELL4;                                                        // 0x013C
    kal_uint32 RSSI_EXP_CELL4;                                                            // 0x0140
    kal_uint32 RSSI_MAN_RX0_CELL5;                                                        // 0x0144
    kal_uint32 RSSI_MAN_RX1_CELL5;                                                        // 0x0148
    kal_uint32 RSSI_EXP_CELL5;                                                            // 0x014C
    kal_uint32 RSSI_MAN_RX0_CELL6;                                                        // 0x0150
    kal_uint32 RSSI_MAN_RX1_CELL6;                                                        // 0x0154
    kal_uint32 RSSI_EXP_CELL6;                                                            // 0x0158
    kal_uint32 RSSI_MAN_RX0_CELL7;                                                        // 0x015C
    kal_uint32 RSSI_MAN_RX1_CELL7;                                                        // 0x0160
    kal_uint32 RSSI_EXP_CELL7;                                                            // 0x0164
    kal_uint32 RSSI_MAN_RX0_CELL8;                                                        // 0x0168
    kal_uint32 RSSI_MAN_RX1_CELL8;                                                        // 0x016C
    kal_uint32 RSSI_EXP_CELL8;                                                            // 0x0170
    kal_uint32 RSSI_MAN_RX0_CELL9;                                                        // 0x0174
    kal_uint32 RSSI_MAN_RX1_CELL9;                                                        // 0x0178
    kal_uint32 RSSI_EXP_CELL9;                                                            // 0x017C
    kal_uint32 RSSI_MAN_RX0_CELL10;                                                       // 0x0180
    kal_uint32 RSSI_MAN_RX1_CELL10;                                                       // 0x0184
    kal_uint32 RSSI_EXP_CELL10;                                                           // 0x0188
    kal_uint32 RSSI_MAN_RX0_CELL11;                                                       // 0x018C
    kal_uint32 RSSI_MAN_RX1_CELL11;                                                       // 0x0190
    kal_uint32 RSSI_EXP_CELL11;                                                           // 0x0194
    kal_uint32 RSRP_MAN_P0_RX0_CELL0;                                                     // 0x0198
    kal_uint32 RSRP_MAN_P0_RX1_CELL0;                                                     // 0x019C
    kal_uint32 RSRP_EXP_P0_CELL0;                                                         // 0x01A0
    kal_uint32 RSRP_MAN_P1_RX0_CELL0;                                                     // 0x01A4
    kal_uint32 RSRP_MAN_P1_RX1_CELL0;                                                     // 0x01A8
    kal_uint32 RSRP_EXP_P1_CELL0;                                                         // 0x01AC
    kal_uint32 RSRP_MAN_P0_RX0_CELL1;                                                     // 0x01B0
    kal_uint32 RSRP_MAN_P0_RX1_CELL1;                                                     // 0x01B4
    kal_uint32 RSRP_EXP_P0_CELL1;                                                         // 0x01B8
    kal_uint32 RSRP_MAN_P1_RX0_CELL1;                                                     // 0x01BC
    kal_uint32 RSRP_MAN_P1_RX1_CELL1;                                                     // 0x01C0
    kal_uint32 RSRP_EXP_P1_CELL1;                                                         // 0x01C4
    kal_uint32 RSRP_MAN_P0_RX0_CELL2;                                                     // 0x01C8
    kal_uint32 RSRP_MAN_P0_RX1_CELL2;                                                     // 0x01CC
    kal_uint32 RSRP_EXP_P0_CELL2;                                                         // 0x01D0
    kal_uint32 RSRP_MAN_P1_RX0_CELL2;                                                     // 0x01D4
    kal_uint32 RSRP_MAN_P1_RX1_CELL2;                                                     // 0x01D8
    kal_uint32 RSRP_EXP_P1_CELL2;                                                         // 0x01DC
    kal_uint32 RSRP_MAN_P0_RX0_CELL3;                                                     // 0x01E0
    kal_uint32 RSRP_MAN_P0_RX1_CELL3;                                                     // 0x01E4
    kal_uint32 RSRP_EXP_P0_CELL3;                                                         // 0x01E8
    kal_uint32 RSRP_MAN_P1_RX0_CELL3;                                                     // 0x01EC
    kal_uint32 RSRP_MAN_P1_RX1_CELL3;                                                     // 0x01F0
    kal_uint32 RSRP_EXP_P1_CELL3;                                                         // 0x01F4
    kal_uint32 RSRP_MAN_P0_RX0_CELL4;                                                     // 0x01F8
    kal_uint32 RSRP_MAN_P0_RX1_CELL4;                                                     // 0x01FC
    kal_uint32 RSRP_EXP_P0_CELL4;                                                         // 0x0200
    kal_uint32 RSRP_MAN_P1_RX0_CELL4;                                                     // 0x0204
    kal_uint32 RSRP_MAN_P1_RX1_CELL4;                                                     // 0x0208
    kal_uint32 RSRP_EXP_P1_CELL4;                                                         // 0x020C
    kal_uint32 RSRP_MAN_P0_RX0_CELL5;                                                     // 0x0210
    kal_uint32 RSRP_MAN_P0_RX1_CELL5;                                                     // 0x0214
    kal_uint32 RSRP_EXP_P0_CELL5;                                                         // 0x0218
    kal_uint32 RSRP_MAN_P1_RX0_CELL5;                                                     // 0x021C
    kal_uint32 RSRP_MAN_P1_RX1_CELL5;                                                     // 0x0220
    kal_uint32 RSRP_EXP_P1_CELL5;                                                         // 0x0224
    kal_uint32 RSRP_MAN_P0_RX0_CELL6;                                                     // 0x0228
    kal_uint32 RSRP_MAN_P0_RX1_CELL6;                                                     // 0x022C
    kal_uint32 RSRP_EXP_P0_CELL6;                                                         // 0x0230
    kal_uint32 RSRP_MAN_P1_RX0_CELL6;                                                     // 0x0234
    kal_uint32 RSRP_MAN_P1_RX1_CELL6;                                                     // 0x0238
    kal_uint32 RSRP_EXP_P1_CELL6;                                                         // 0x023C
    kal_uint32 RSRP_MAN_P0_RX0_CELL7;                                                     // 0x0240
    kal_uint32 RSRP_MAN_P0_RX1_CELL7;                                                     // 0x0244
    kal_uint32 RSRP_EXP_P0_CELL7;                                                         // 0x0248
    kal_uint32 RSRP_MAN_P1_RX0_CELL7;                                                     // 0x024C
    kal_uint32 RSRP_MAN_P1_RX1_CELL7;                                                     // 0x0250
    kal_uint32 RSRP_EXP_P1_CELL7;                                                         // 0x0254
    kal_uint32 RSRP_MAN_P0_RX0_CELL8;                                                     // 0x0258
    kal_uint32 RSRP_MAN_P0_RX1_CELL8;                                                     // 0x025C
    kal_uint32 RSRP_EXP_P0_CELL8;                                                         // 0x0260
    kal_uint32 RSRP_MAN_P1_RX0_CELL8;                                                     // 0x0264
    kal_uint32 RSRP_MAN_P1_RX1_CELL8;                                                     // 0x0268
    kal_uint32 RSRP_EXP_P1_CELL8;                                                         // 0x026C
    kal_uint32 RSRP_MAN_P0_RX0_CELL9;                                                     // 0x0270
    kal_uint32 RSRP_MAN_P0_RX1_CELL9;                                                     // 0x0274
    kal_uint32 RSRP_EXP_P0_CELL9;                                                         // 0x0278
    kal_uint32 RSRP_MAN_P1_RX0_CELL9;                                                     // 0x027C
    kal_uint32 RSRP_MAN_P1_RX1_CELL9;                                                     // 0x0280
    kal_uint32 RSRP_EXP_P1_CELL9;                                                         // 0x0284
    kal_uint32 RSRP_MAN_P0_RX0_CELL10;                                                    // 0x0288
    kal_uint32 RSRP_MAN_P0_RX1_CELL10;                                                    // 0x028C
    kal_uint32 RSRP_EXP_P0_CELL10;                                                        // 0x0290
    kal_uint32 RSRP_MAN_P1_RX0_CELL10;                                                    // 0x0294
    kal_uint32 RSRP_MAN_P1_RX1_CELL10;                                                    // 0x0298
    kal_uint32 RSRP_EXP_P1_CELL10;                                                        // 0x029C
    kal_uint32 RSRP_MAN_P0_RX0_CELL11;                                                    // 0x02A0
    kal_uint32 RSRP_MAN_P0_RX1_CELL11;                                                    // 0x02A4
    kal_uint32 RSRP_EXP_P0_CELL11;                                                        // 0x02A8
    kal_uint32 RSRP_MAN_P1_RX0_CELL11;                                                    // 0x02AC
    kal_uint32 RSRP_MAN_P1_RX1_CELL11;                                                    // 0x02B0
    kal_uint32 RSRP_EXP_P1_CELL11;                                                        // 0x02B4
    kal_uint32 RSTP_MAN_P0_RX0_CELL0;                                                     // 0x02B8
    kal_uint32 RSTP_MAN_P0_RX1_CELL0;                                                     // 0x02BC
    kal_uint32 RSTP_EXP_P0_CELL0;                                                         // 0x02C0
    kal_uint32 RSTP_MAN_P1_RX0_CELL0;                                                     // 0x02C4
    kal_uint32 RSTP_MAN_P1_RX1_CELL0;                                                     // 0x02C8
    kal_uint32 RSTP_EXP_P1_CELL0;                                                         // 0x02CC
    kal_uint32 RSTP_MAN_P0_RX0_CELL1;                                                     // 0x02D0
    kal_uint32 RSTP_MAN_P0_RX1_CELL1;                                                     // 0x02D4
    kal_uint32 RSTP_EXP_P0_CELL1;                                                         // 0x02D8
    kal_uint32 RSTP_MAN_P1_RX0_CELL1;                                                     // 0x02DC
    kal_uint32 RSTP_MAN_P1_RX1_CELL1;                                                     // 0x02E0
    kal_uint32 RSTP_EXP_P1_CELL1;                                                         // 0x02E4
    kal_uint32 RSTP_MAN_P0_RX0_CELL2;                                                     // 0x02E8
    kal_uint32 RSTP_MAN_P0_RX1_CELL2;                                                     // 0x02EC
    kal_uint32 RSTP_EXP_P0_CELL2;                                                         // 0x02F0
    kal_uint32 RSTP_MAN_P1_RX0_CELL2;                                                     // 0x02F4
    kal_uint32 RSTP_MAN_P1_RX1_CELL2;                                                     // 0x02F8
    kal_uint32 RSTP_EXP_P1_CELL2;                                                         // 0x02FC
    kal_uint32 RSTP_MAN_P0_RX0_CELL3;                                                     // 0x0300
    kal_uint32 RSTP_MAN_P0_RX1_CELL3;                                                     // 0x0304
    kal_uint32 RSTP_EXP_P0_CELL3;                                                         // 0x0308
    kal_uint32 RSTP_MAN_P1_RX0_CELL3;                                                     // 0x030C
    kal_uint32 RSTP_MAN_P1_RX1_CELL3;                                                     // 0x0310
    kal_uint32 RSTP_EXP_P1_CELL3;                                                         // 0x0314
    kal_uint32 RSTP_MAN_P0_RX0_CELL4;                                                     // 0x0318
    kal_uint32 RSTP_MAN_P0_RX1_CELL4;                                                     // 0x031C
    kal_uint32 RSTP_EXP_P0_CELL4;                                                         // 0x0320
    kal_uint32 RSTP_MAN_P1_RX0_CELL4;                                                     // 0x0324
    kal_uint32 RSTP_MAN_P1_RX1_CELL4;                                                     // 0x0328
    kal_uint32 RSTP_EXP_P1_CELL4;                                                         // 0x032C
    kal_uint32 RSTP_MAN_P0_RX0_CELL5;                                                     // 0x0330
    kal_uint32 RSTP_MAN_P0_RX1_CELL5;                                                     // 0x0334
    kal_uint32 RSTP_EXP_P0_CELL5;                                                         // 0x0338
    kal_uint32 RSTP_MAN_P1_RX0_CELL5;                                                     // 0x033C
    kal_uint32 RSTP_MAN_P1_RX1_CELL5;                                                     // 0x0340
    kal_uint32 RSTP_EXP_P1_CELL5;                                                         // 0x0344
    kal_uint32 RSTP_MAN_P0_RX0_CELL6;                                                     // 0x0348
    kal_uint32 RSTP_MAN_P0_RX1_CELL6;                                                     // 0x034C
    kal_uint32 RSTP_EXP_P0_CELL6;                                                         // 0x0350
    kal_uint32 RSTP_MAN_P1_RX0_CELL6;                                                     // 0x0354
    kal_uint32 RSTP_MAN_P1_RX1_CELL6;                                                     // 0x0358
    kal_uint32 RSTP_EXP_P1_CELL6;                                                         // 0x035C
    kal_uint32 RSTP_MAN_P0_RX0_CELL7;                                                     // 0x0360
    kal_uint32 RSTP_MAN_P0_RX1_CELL7;                                                     // 0x0364
    kal_uint32 RSTP_EXP_P0_CELL7;                                                         // 0x0368
    kal_uint32 RSTP_MAN_P1_RX0_CELL7;                                                     // 0x036C
    kal_uint32 RSTP_MAN_P1_RX1_CELL7;                                                     // 0x0370
    kal_uint32 RSTP_EXP_P1_CELL7;                                                         // 0x0374
    kal_uint32 RSTP_MAN_P0_RX0_CELL8;                                                     // 0x0378
    kal_uint32 RSTP_MAN_P0_RX1_CELL8;                                                     // 0x037C
    kal_uint32 RSTP_EXP_P0_CELL8;                                                         // 0x0380
    kal_uint32 RSTP_MAN_P1_RX0_CELL8;                                                     // 0x0384
    kal_uint32 RSTP_MAN_P1_RX1_CELL8;                                                     // 0x0388
    kal_uint32 RSTP_EXP_P1_CELL8;                                                         // 0x038C
    kal_uint32 RSTP_MAN_P0_RX0_CELL9;                                                     // 0x0390
    kal_uint32 RSTP_MAN_P0_RX1_CELL9;                                                     // 0x0394
    kal_uint32 RSTP_EXP_P0_CELL9;                                                         // 0x0398
    kal_uint32 RSTP_MAN_P1_RX0_CELL9;                                                     // 0x039C
    kal_uint32 RSTP_MAN_P1_RX1_CELL9;                                                     // 0x03A0
    kal_uint32 RSTP_EXP_P1_CELL9;                                                         // 0x03A4
    kal_uint32 RSTP_MAN_P0_RX0_CELL10;                                                    // 0x03A8
    kal_uint32 RSTP_MAN_P0_RX1_CELL10;                                                    // 0x03AC
    kal_uint32 RSTP_EXP_P0_CELL10;                                                        // 0x03B0
    kal_uint32 RSTP_MAN_P1_RX0_CELL10;                                                    // 0x03B4
    kal_uint32 RSTP_MAN_P1_RX1_CELL10;                                                    // 0x03B8
    kal_uint32 RSTP_EXP_P1_CELL10;                                                        // 0x03BC
    kal_uint32 RSTP_MAN_P0_RX0_CELL11;                                                    // 0x03C0
    kal_uint32 RSTP_MAN_P0_RX1_CELL11;                                                    // 0x03C4
    kal_uint32 RSTP_EXP_P0_CELL11;                                                        // 0x03C8
    kal_uint32 RSTP_MAN_P1_RX0_CELL11;                                                    // 0x03CC
    kal_uint32 RSTP_MAN_P1_RX1_CELL11;                                                    // 0x03D0
    kal_uint32 RSTP_EXP_P1_CELL11;                                                        // 0x03D4
} CUIF_LTE_NCM_CC_RPT_REGS, *PCUIF_LTE_NCM_CC_RPT_REGS;

// ---------- CUIF_LTE_NCM_CC_RPT word-offset  ----------
#define O_CUIF_LTE_NCM_CC_RPT_INFO(i)                                                     (0 + (i))
#define O_CUIF_LTE_NCM_CC_RPT_GDE_TIME_OFFSET(i)                                          (12 + (i))
#define O_CUIF_LTE_NCM_CC_RPT_IIR(i)                                                      (18 + (i))
#define O_CUIF_LTE_NCM_CC_RPT_GDE_MAN_P0_CELL0                                            (30)
#define O_CUIF_LTE_NCM_CC_RPT_GDE_MAN_P1_CELL0                                            (31)
#define O_CUIF_LTE_NCM_CC_RPT_GDE_EXP_CELL0                                               (32)
#define O_CUIF_LTE_NCM_CC_RPT_GDE_MAN_P0_CELL1                                            (33)
