#ifndef __CUIF_LTE_RX_CC_RPT_H__
#define __CUIF_LTE_RX_CC_RPT_H__

// ----------------- CUIF_LTE_RX_CC_RPT Register Definition -------------------
typedef volatile struct {
    kal_uint32 AFC_RPT0;                                                                  // 0x0000
    kal_uint32 AFC_RPT1;                                                                  // 0x0004
    kal_uint32 AFC_RPT2;                                                                  // 0x0008
    kal_uint32 AFC_RPT3;                                                                  // 0x000C
    kal_uint32 AFC_RPT4;                                                                  // 0x0010
    kal_uint32 AFC_RPT5;                                                                  // 0x0014
    kal_uint32 FWS_RPT0;                                                                  // 0x0018
    kal_uint32 FWS_RPT1;                                                                  // 0x001C
    kal_uint32 FWS_RPT2;                                                                  // 0x0020
    kal_uint32 FWS_RPT3;                                                                  // 0x0024
    kal_uint32 FWS_RPT4;                                                                  // 0x0028
    kal_uint32 FWS_RPT5;                                                                  // 0x002C
    kal_uint32 MD_RPT0;                                                                   // 0x0030
    kal_uint32 NE_RPT0;                                                                   // 0x0034
    kal_uint32 NE_RPT1;                                                                   // 0x0038
    kal_uint32 NE_RPT2;                                                                   // 0x003C
    kal_uint32 NE_RPT3;                                                                   // 0x0040
    kal_uint32 NE_RPT4;                                                                   // 0x0044
    kal_uint32 RRM_RPT0;                                                                  // 0x0048
    kal_uint32 RRM_RPT1;                                                                  // 0x004C
    kal_uint32 RRM_RPT2;                                                                  // 0x0050
    kal_uint32 RRM_RPT3;                                                                  // 0x0054
    kal_uint32 RRM_RPT4;                                                                  // 0x0058
    kal_uint32 RRM_RPT5;                                                                  // 0x005C
    kal_uint32 RRM_RPT6;                                                                  // 0x0060
    kal_uint32 RRM_RSSI_MAN_RX0;                                                          // 0x0064
    kal_uint32 RRM_RSSI_MAN_RX1;                                                          // 0x0068
    kal_uint32 RRM_RSSI_EXP;                                                              // 0x006C
    kal_uint32 RRM_ALL_SYM_RSSI_MAN_RX0;                                                  // 0x0070
    kal_uint32 RRM_ALL_SYM_RSSI_MAN_RX1;                                                  // 0x0074
    kal_uint32 RRM_ALL_SYM_RSSI_EXP;                                                      // 0x0078
    kal_uint32 RRM_MBSFN_RSSI_MAN_RX0;                                                    // 0x007C
    kal_uint32 RRM_MBSFN_RSSI_MAN_RX1;                                                    // 0x0080
    kal_uint32 RRM_MBSFN_RSSI_EXP;                                                        // 0x0084
    kal_uint32 RRM_MBSFN_RSRP_MAN_RX0;                                                    // 0x0088
    kal_uint32 RRM_MBSFN_RSRP_MAN_RX1;                                                    // 0x008C
    kal_uint32 RRM_MBSFN_RSRP_EXP;                                                        // 0x0090
    kal_uint32 NBI_RPT0;                                                                  // 0x0094
    kal_uint32 NBI_SPUR_PWR_RX0;                                                          // 0x0098
    kal_uint32 NBI_SPUR_PWR_RX1;                                                          // 0x009C
    kal_uint32 RRM_RSSI_MEAS_MAN_RX0;                                                     // 0x00A0
    kal_uint32 RRM_RSSI_MEAS_MAN_RX1;                                                     // 0x00A4
    kal_uint32 RRM_RSSI_MEAS_EXP;                                                         // 0x00A8
    kal_uint32 RRM_ALL_SYM_RSSI_MEAS_MAN_RX0;                                             // 0x00AC
    kal_uint32 RRM_ALL_SYM_RSSI_MEAS_MAN_RX1;                                             // 0x00B0
    kal_uint32 RRM_ALL_SYM_RSSI_MEAS_EXP;                                                 // 0x00B4
    kal_uint32 CSI_RPT0;                                                                  // 0x00B8
    kal_uint32 RRM_RPT7;                                                                  // 0x00BC
    kal_uint32 RRM_RPT8;                                                                  // 0x00C0
    kal_uint32 RRM_RPT9;                                                                  // 0x00C4
} CUIF_LTE_RX_CC_RPT_REGS, *PCUIF_LTE_RX_CC_RPT_REGS;

// ---------- CUIF_LTE_RX_CC_RPT word-offset  ----------
#define O_CUIF_LTE_RX_CC_RPT_AFC_RPT0                                                     (0)
#define O_CUIF_LTE_RX_CC_RPT_AFC_RPT1                                                     (1)
#define O_CUIF_LTE_RX_CC_RPT_AFC_RPT2                                                     (2)
#define O_CUIF_LTE_RX_CC_RPT_AFC_RPT3                                                     (3)
#define O_CUIF_LTE_RX_CC_RPT_AFC_RPT4                                                     (4)
#define O_CUIF_LTE_RX_CC_RPT_AFC_RPT5                                                     (5)
#define O_CUIF_LTE_RX_CC_RPT_FWS_RPT0                                                     (6)
#define O_CUIF_LTE_RX_CC_RPT_FWS_RPT1                                                     (7)
