#ifndef __CUIF_LTE_RX_BRP_DL_CC_RPT_H__
#define __CUIF_LTE_RX_BRP_DL_CC_RPT_H__

// ----------------- CUIF_LTE_RX_BRP_DL_CC_RPT Register Definition -------------------
typedef volatile struct {
    kal_uint32 CUIF_DCI_RA;                                                               // 0x0000
    kal_uint32 CUIF_DCI_PI;                                                               // 0x0004
    kal_uint32 CUIF_DCI_SI;                                                               // 0x0008
    kal_uint32 CUIF_DCI_C_SPS_TC0;                                                        // 0x000C
    kal_uint32 CUIF_DCI_C_SPS_TC1;                                                        // 0x0010
    kal_uint32 CUIF_DCI_C_SPS_TC2;                                                        // 0x0014
    kal_uint32 CUIF_DCI_NOMA;                                                             // 0x0018
    kal_uint32 CUIF_DCI_ORDER;                                                            // 0x001C
    kal_uint32 CUIF_DCI_M;                                                                // 0x0020
    kal_uint32 CUIF_DCI_MISS_IND;                                                         // 0x0024
    kal_uint32 CUIF_PCFICH_RESULT;                                                        // 0x0028
    kal_uint32 CUIF_DCI_TPC_PUCCH;                                                        // 0x002C
    kal_uint32 CUIF_DCI_TPC_PUSCH;                                                        // 0x0030
    kal_uint32 CUIF_DCI_RESERVED;                                                         // 0x0034
    kal_uint32 CUIF_PDSCH_RESULT;                                                         // 0x0038
    kal_uint32 CUIF_PDSCH;                                                                // 0x003C
    kal_uint32 CUIF_PDSCH_CBINFO_TB1;                                                     // 0x0040
    kal_uint32 CUIF_PDSCH_CBINFO_TB2;                                                     // 0x0044
    kal_uint32 CUIF_PDSCH_CBCRC;                                                          // 0x0048
    kal_uint32 CUIF_PDSCH_PI;                                                             // 0x004C
    kal_uint32 CUIF_RA_SI_PI_RESULT;                                                      // 0x0050
    kal_uint32 CUIF_PDSCH_CODE_RATE;                                                      // 0x0054
    kal_uint32 CUIF_PDSCH_SI_RA;                                                          // 0x0058
    kal_uint32 CUIF_PDSCH_RESERVED;                                                       // 0x005C
} CUIF_LTE_RX_BRP_DL_CC_RPT_REGS, *PCUIF_LTE_RX_BRP_DL_CC_RPT_REGS;

// ---------- CUIF_LTE_RX_BRP_DL_CC_RPT word-offset  ----------
#define O_CUIF_LTE_RX_BRP_DL_CC_RPT_CUIF_DCI_RA                                           (0)
#define O_CUIF_LTE_RX_BRP_DL_CC_RPT_CUIF_DCI_PI                                           (1)
#define O_CUIF_LTE_RX_BRP_DL_CC_RPT_CUIF_DCI_SI                                           (2)
#define O_CUIF_LTE_RX_BRP_DL_CC_RPT_CUIF_DCI_C_SPS_TC0                                    (3)
#define O_CUIF_LTE_RX_BRP_DL_CC_RPT_CUIF_DCI_C_SPS_TC1                                    (4)
#define O_CUIF_LTE_RX_BRP_DL_CC_RPT_CUIF_DCI_C_SPS_TC2                                    (5)
#define O_CUIF_LTE_RX_BRP_DL_CC_RPT_CUIF_DCI_NOMA                                         (6)
#define O_CUIF_LTE_RX_BRP_DL_CC_RPT_CUIF_DCI_ORDER                                        (7)
