// Auto_Gen----------------- rxbrp_md32erk_cmif_MD32 Register Definition -------------------

#ifndef _rxbrp_md32erk_cmif_MD32_H_
#define _rxbrp_md32erk_cmif_MD32_H_

// Auto_Gen----------------- rxbrp_md32erk_cmif_MD32 Histories -------------------
// Revision			Date			Author			Description
// 0.1			2013/11/7			MingChia Tsai			draft version of rakesys cdif			
// 0.2			2014/1/21			Playpony Ma			Add event for CTI			
// 0.3			2014/2/17			Playpony Ma			1. Separate IRQ to IRQ_STA and IRQ_SET/IRQ_CLR2. Add M2C_WFI_IRQ_STA and M2C_WFI_IRQ_MASK			
// 0.4			2014/3/6			Playpony Ma			1. Release template 2. Add rxbrp irq event for first released			

#include "CMIF_LTE_BASE.h"
// ----------------- rxbrp_md32erk_cmif_MD32 Register Definition -------------------
typedef volatile struct
{
    UINT32 M2C_WFI_IRQ_STA_REG;                       // 8000
    UINT32 M2C_WFI_IRQ_MASK_REG;                      // 8004
    UINT32 M2CTI_EVENT_REG;                           // 8008
    UINT32 C2M_U3G_IRQ_STA_REG;                       // 800C
    UINT32 C2M_U3G_IRQ_CLR_REG;                       // 8010
    UINT32 C2M_U4G_IRQ_STA_REG;                       // 8014
    UINT32 C2M_U4G_IRQ_CLR_REG;                       // 8018
    UINT32 M2C_U3G_IRQ_STA_REG;                       // 801C
    UINT32 M2C_U3G_IRQ_SET_REG;                       // 8020
    UINT32 M2C_U4G_IRQ_STA_REG;                       // 8024
    UINT32 M2C_U4G_IRQ_SET_REG;                       // 8028
    UINT32 RESERVED_OS_LOG_REG[64];                   // 802C..8128
}rxbrp_md32erk_cmif_MD32_REGS, *Prxbrp_md32erk_cmif_MD32_REGS;

/*
************************************************************************************************************************************************************************************************************************************************************
* Register : M2C_WFI_IRQ_STA , Description : M2C_WFI_IRQ STATUS
*   M2C_WFI_IRQ_STA : Bit 0 ~ 0. Description~ M2C_WFI_IRQ_STATUS = M2C_WFI_IRQ_MASK & MD32_CORE_HALT.. MD32 write M2C_WFI_IRQ_MASK to enable the WFI_IRQ for L1core. WFI_IRQ will be happened once the MD32 core enter WFI mode. If it is not zero, M2C_WFI_IRQ is always triggered. 
