#ifndef __CUIF_WCDMA_HSCE_H__
#define __CUIF_WCDMA_HSCE_H__

// ----------------- CUIF_WCDMA_HSCE Register Definition -------------------
typedef volatile struct {
    kal_uint32 HSCE_OV_CON;                                                               // 0xA000
    kal_uint32 HSCE_OCIC;                                                                 // 0xA004
    kal_uint32 HSCE_RST;                                                                  // 0xA008
    kal_uint32 HSCE_CON0;                                                                 // 0xA00C
    kal_uint32 HSCE_CON1;                                                                 // 0xA010
    kal_uint32 HSCE_CH1_CON0;                                                             // 0xA014
    kal_uint32 HSCE_CH1_CON1;                                                             // 0xA018
    kal_uint32 HSCE_CH1_CON2;                                                             // 0xA01C
    kal_uint32 HSCE_CH1_CON3;                                                             // 0xA020
    kal_uint32 HSCE_CH2_CON0;                                                             // 0xA024
    kal_uint32 HSCE_CH2_CON1;                                                             // 0xA028
    kal_uint32 HSCE_CH2_CON2;                                                             // 0xA02C
    kal_uint32 HSCE_CH3_CON0;                                                             // 0xA030
    kal_uint32 HSCE_CH3_CON1;                                                             // 0xA034
    kal_uint32 HSCE_CH4_CON0;                                                             // 0xA038
    kal_uint32 HSCE_CH4_CON1;                                                             // 0xA03C
    kal_uint32 HSCE_EQ0;                                                                  // 0xA040
    kal_uint32 HSCE_EQ1;                                                                  // 0xA044
    kal_uint32 HSCE_EQ2;                                                                  // 0xA048
    kal_uint32 HSCE_MPATH0;                                                               // 0xA04C
    kal_uint32 HSCE_MPATH1;                                                               // 0xA050
    kal_uint32 HSCE_MPATH2;                                                               // 0xA054
    kal_uint32 HSCE_MPATH3;                                                               // 0xA058
    kal_uint32 HSCE_MPATH4;                                                               // 0xA05C
    kal_uint32 HSCE_MPATH5;                                                               // 0xA060
    kal_uint32 HSCE_IOEST;                                                                // 0xA064
    kal_uint32 HSCE_WC0;                                                                  // 0xA068
    kal_uint32 HSCE_WC1;                                                                  // 0xA06C
    kal_uint32 HSCE_WC2;                                                                  // 0xA070
    kal_uint32 HSCE_WC3;                                                                  // 0xA074
    kal_uint32 HSCE_SPEST_CON0;                                                           // 0xA078
    kal_uint32 HSCE_SPEST_CON1;                                                           // 0xA07C
    kal_uint32 HSCE_SPEST_LCR0;                                                           // 0xA080
    kal_uint32 HSCE_SPEST_LCR1;                                                           // 0xA084
    kal_uint32 HSCE_SPEST_LCR2;                                                           // 0xA088
    kal_uint32 HSCE_SPEST_LCR3;                                                           // 0xA08C
    kal_uint32 HSCE_SPEST_INT0;                                                           // 0xA090
    kal_uint32 HSCE_SPEST_INT1;                                                           // 0xA094
    kal_uint32 HSCE_DBG_CON;                                                              // 0xA098
    kal_uint32 HSCE_DBG_LOG0;                                                             // 0xA09C
    kal_uint32 HSCE_DBG_LOG1;                                                             // 0xA0A0
    kal_uint32 HSCE_DBG_LOG2;                                                             // 0xA0A4
    kal_uint32 HSCE_DBG_LOG3;                                                             // 0xA0A8
    kal_uint32 HSCE_DBG_LOG4;                                                             // 0xA0AC
    kal_uint32 HSCE_DBG_LOG5;                                                             // 0xA0B0
    kal_uint32 HSCE_DBG_LOG6;                                                             // 0xA0B4
    kal_uint32 HSCE_DBG_LOG7;                                                             // 0xA0B8
    kal_uint32 HSCE_RFEQ_CON0;                                                            // 0xA0BC
    kal_uint32 HSCE_RFEQ_RX0_COEF[7];                                                     // 0xA0C0
    kal_uint32 HSCE_RFEQ_RX1_COEF[7];                                                     // 0xA0DC
} CUIF_WCDMA_HSCE_REGS, *PCUIF_WCDMA_HSCE_REGS;

// ---------- CUIF_WCDMA_HSCE word-offset  ----------
#define O_CUIF_WCDMA_HSCE_HSCE_OV_CON                                                     (0)
#define O_CUIF_WCDMA_HSCE_HSCE_OCIC                                                       (1)
#define O_CUIF_WCDMA_HSCE_HSCE_RST                                                        (2)
#define O_CUIF_WCDMA_HSCE_HSCE_CON0                                                       (3)
#define O_CUIF_WCDMA_HSCE_HSCE_CON1                                                       (4)
#define O_CUIF_WCDMA_HSCE_HSCE_CH1_CON0                                                   (5)
#define O_CUIF_WCDMA_HSCE_HSCE_CH1_CON1                                                   (6)
#define O_CUIF_WCDMA_HSCE_HSCE_CH1_CON2                                                   (7)
