#ifndef __RXBRP_C_EVDO_H__
#define __RXBRP_C_EVDO_H__

// ----------------- RXBRP_C_EVDO Register Definition -------------------
typedef volatile struct {
    kal_uint32 DBRP_EVDO_START;                                                           // 0x0000
    kal_uint32 DBRP_EVDO_DONE;                                                            // 0x0004
    kal_uint32 DBRP_EVDO_DONE_VEC;                                                        // 0x0008
    kal_uint32 DBRP_EVDO_CH_DET;                                                          // 0x000C
    kal_uint32 DBRP_EVDO_HARQ_INFO;                                                       // 0x0010
    kal_uint32 DBRP_EVDO_C2I_SCAL_QPSK;                                                   // 0x0014
    kal_uint32 DBRP_EVDO_C2I_SCAL_8PSK;                                                   // 0x0018
    kal_uint32 DBRP_EVDO_C2I_SCAL_16QAM;                                                  // 0x001C
    kal_uint32 rsv_0020[32];                                                              // 0x0020..0x009C
    kal_uint32 DBRP_EVDO_HARQ_DBG;                                                        // 0x00A0
    kal_uint32 DBRP_EVDO_C2I_RD;                                                          // 0x00A4
    kal_uint32 DBRP_EVDO_C2I_RD_ADDR;                                                     // 0x00A8
    kal_uint32 DBRP_EVDO_C2I_RD_DATA;                                                     // 0x00AC
    kal_uint32 DBRP_EVDO_HARQ_RD;                                                         // 0x00B0
    kal_uint32 DBRP_EVDO_HARQ_RD_ADDR;                                                    // 0x00B4
    kal_uint32 DBRP_EVDO_HARQ_RD_DATA;                                                    // 0x00B8
    kal_uint32 DBRP_EVDO_HARQ_ABSACC_03;                                                  // 0x00BC
    kal_uint32 DBRP_EVDO_HARQ_ABSACC_47;                                                  // 0x00C0
    kal_uint32 rsv_00C4[3];                                                               // 0x00C4..0x00CC
    kal_uint32 DBRP_EVDO_DBG0;                                                            // 0x00D0
    kal_uint32 rsv_00D4[7];                                                               // 0x00D4..0x00EC
    kal_uint32 DBRP_EVDO_PWR_CFG;                                                         // 0x00F0
    kal_uint32 rsv_00F4[3];                                                               // 0x00F4..0x00FC
    kal_uint32 DBRP_EVDO_HARQ_PARAM;                                                      // 0x0100
    kal_uint32 DBRP_EVDO_CH0_PARAM1;                                                      // 0x0104
    kal_uint32 DBRP_EVDO_CH0_PARAM2;                                                      // 0x0108
    kal_uint32 DBRP_EVDO_CH0_PARAM3;                                                      // 0x010C
    kal_uint32 DBRP_EVDO_CH1_PARAM1;                                                      // 0x0110
    kal_uint32 DBRP_EVDO_CH1_PARAM2;                                                      // 0x0114
    kal_uint32 DBRP_EVDO_CH1_PARAM3;                                                      // 0x0118
    kal_uint32 DBRP_EVDO_CH2_PARAM1;                                                      // 0x011C
    kal_uint32 DBRP_EVDO_CH2_PARAM2;                                                      // 0x0120
    kal_uint32 DBRP_EVDO_CH2_PARAM3;                                                      // 0x0124
    kal_uint32 DBRP_EVDO_CH3_PARAM1;                                                      // 0x0128
    kal_uint32 DBRP_EVDO_CH3_PARAM2;                                                      // 0x012C
    kal_uint32 DBRP_EVDO_CH3_PARAM3;                                                      // 0x0130
    kal_uint32 rsv_0134[51];                                                              // 0x0134..0x01FC
    kal_uint32 DBRP_EVDO_C2I_PARAM0;                                                      // 0x0200
    kal_uint32 DBRP_EVDO_C2I_PARAM1;                                                      // 0x0204
} RXBRP_C_EVDO_REGS, *PRXBRP_C_EVDO_REGS;

// ---------- RXBRP_C_EVDO word-offset  ----------
#define O_RXBRP_C_EVDO_DBRP_EVDO_START                                                    (0)
#define O_RXBRP_C_EVDO_DBRP_EVDO_DONE                                                     (1)
#define O_RXBRP_C_EVDO_DBRP_EVDO_DONE_VEC                                                 (2)
#define O_RXBRP_C_EVDO_DBRP_EVDO_CH_DET                                                   (3)
#define O_RXBRP_C_EVDO_DBRP_EVDO_HARQ_INFO                                                (4)
#define O_RXBRP_C_EVDO_DBRP_EVDO_C2I_SCAL_QPSK                                            (5)
#define O_RXBRP_C_EVDO_DBRP_EVDO_C2I_SCAL_8PSK                                            (6)
#define O_RXBRP_C_EVDO_DBRP_EVDO_C2I_SCAL_16QAM                                           (7)
