#ifndef __RXBRP_WCT_DMA_H__
#define __RXBRP_WCT_DMA_H__

// ----------------- RXBRP_WCT_DMA Register Definition -------------------
typedef volatile struct {
    kal_uint32 DBRP_DMA_RESET;                                                            // 0x0000
    kal_uint32 DBRP_DMA_CH0;                                                              // 0x0004
    kal_uint32 DBRP_DMA_CH0_REQ;                                                          // 0x0008
    kal_uint32 DBRP_DMA_CH0_CTRL;                                                         // 0x000C
    kal_uint32 DBRP_DMA_CH0_CTRL_DATA_PING;                                               // 0x0010
    kal_uint32 DBRP_DMA_CH0_CTRL_DATA_PONG;                                               // 0x0014
    kal_uint32 DBRP_DMA_CH0_CTRL_DATA;                                                    // 0x0018
    kal_uint32 DBRP_DMA_CH1;                                                              // 0x001C
    kal_uint32 DBRP_DMA_CH1_REQ;                                                          // 0x0020
    kal_uint32 DBRP_DMA_CH1_CTRL;                                                         // 0x0024
    kal_uint32 DBRP_DMA_CH1_CTRL_DATA_PING;                                               // 0x0028
    kal_uint32 DBRP_DMA_CH1_CTRL_DATA_PONG;                                               // 0x002C
    kal_uint32 DBRP_DMA_CH1_CTRL_DATA;                                                    // 0x0030
    kal_uint32 DBRP_DMA_CH2;                                                              // 0x0034
    kal_uint32 DBRP_DMA_CH2_REQ;                                                          // 0x0038
    kal_uint32 DBRP_DMA_CH2_CTRL;                                                         // 0x003C
    kal_uint32 DBRP_DMA_CH2_CTRL_CNFG_PING;                                               // 0x0040
    kal_uint32 DBRP_DMA_CH2_CTRL_CNFG_PONG;                                               // 0x0044
    kal_uint32 DBRP_DMA_CH2_CTRL_CNFG;                                                    // 0x0048
    kal_uint32 DBRP_DMA_CH2_CTRL_DATA_PING;                                               // 0x004C
    kal_uint32 DBRP_DMA_CH2_CTRL_DATA_PONG;                                               // 0x0050
    kal_uint32 DBRP_DMA_CH2_CTRL_DATA;                                                    // 0x0054
    kal_uint32 DBRP_DMA_CH3;                                                              // 0x0058
    kal_uint32 DBRP_DMA_CH3_REQ;                                                          // 0x005C
    kal_uint32 DBRP_DMA_CH3_CTRL;                                                         // 0x0060
    kal_uint32 DBRP_DMA_CH3_CTRL_CNFG_PING;                                               // 0x0064
    kal_uint32 DBRP_DMA_CH3_CTRL_CNFG_PONG;                                               // 0x0068
    kal_uint32 DBRP_DMA_CH3_CTRL_CNFG;                                                    // 0x006C
    kal_uint32 DBRP_DMA_CH3_CTRL_DATA_PING;                                               // 0x0070
    kal_uint32 DBRP_DMA_CH3_CTRL_DATA_PONG;                                               // 0x0074
    kal_uint32 DBRP_DMA_CH3_CTRL_DATA;                                                    // 0x0078
    kal_uint32 DBRP_DMA_CH4;                                                              // 0x007C
    kal_uint32 DBRP_DMA_CH4_REQ;                                                          // 0x0080
    kal_uint32 DBRP_DMA_CH4_CTRL;                                                         // 0x0084
    kal_uint32 DBRP_DMA_CH4_CTRL_CNFG_PING_CC0;                                           // 0x0088
    kal_uint32 DBRP_DMA_CH4_CTRL_CNFG_PONG_CC0;                                           // 0x008C
    kal_uint32 DBRP_DMA_CH4_CTRL_CNFG_CC0;                                                // 0x0090
    kal_uint32 DBRP_DMA_CH4_CTRL_DATA_PING_CC0;                                           // 0x0094
    kal_uint32 DBRP_DMA_CH4_CTRL_DATA_PONG_CC0;                                           // 0x0098
    kal_uint32 DBRP_DMA_CH4_CTRL_DATA_CC0;                                                // 0x009C
    kal_uint32 DBRP_DMA_CH4_CTRL_CNFG_PING_CC1;                                           // 0x00A0
    kal_uint32 DBRP_DMA_CH4_CTRL_CNFG_PONG_CC1;                                           // 0x00A4
    kal_uint32 DBRP_DMA_CH4_CTRL_CNFG_CC1;                                                // 0x00A8
    kal_uint32 DBRP_DMA_CH4_CTRL_DATA_PING_CC1;                                           // 0x00AC
    kal_uint32 DBRP_DMA_CH4_CTRL_DATA_PONG_CC1;                                           // 0x00B0
    kal_uint32 DBRP_DMA_CH4_CTRL_DATA_CC1;                                                // 0x00B4
    kal_uint32 DBRP_DMA_CH0_DBG_TIME;                                                     // 0x00B8
    kal_uint32 DBRP_DMA_CH1_DBG_TIME;                                                     // 0x00BC
    kal_uint32 DBRP_DMA_CH2_DBG_TIME;                                                     // 0x00C0
    kal_uint32 DBRP_DMA_CH3_DBG_TIME;                                                     // 0x00C4
    kal_uint32 DBRP_DMA_CH4_DBG_TIME;                                                     // 0x00C8
    kal_uint32 DBRP_DMA_CH0_DBG_TIMEOUT;                                                  // 0x00CC
    kal_uint32 DBRP_DMA_CH1_DBG_TIMEOUT;                                                  // 0x00D0
    kal_uint32 DBRP_DMA_CH2_DBG_TIMEOUT;                                                  // 0x00D4
    kal_uint32 DBRP_DMA_CH3_DBG_TIMEOUT;                                                  // 0x00D8
    kal_uint32 DBRP_DMA_CH4_DBG_TIMEOUT;                                                  // 0x00DC
    kal_uint32 DBRP_DMA_FSM_DBG;                                                          // 0x00E0
    kal_uint32 DBRP_DMA_CTRL_DBG;                                                         // 0x00E4
    kal_uint32 DBRP_DMA_CH0_DBG_TRANS;                                                    // 0x00E8
    kal_uint32 DBRP_DMA_CH1_DBG_TRANS;                                                    // 0x00EC
    kal_uint32 DBRP_DMA_CH2_DBG_TRANS;                                                    // 0x00F0
    kal_uint32 DBRP_DMA_CH3_DBG_TRANS;                                                    // 0x00F4
    kal_uint32 DBRP_DMA_CH4_DBG_TRANS;                                                    // 0x00F8
} RXBRP_WCT_DMA_REGS, *PRXBRP_WCT_DMA_REGS;

// ---------- RXBRP_WCT_DMA word-offset  ----------
#define O_RXBRP_WCT_DMA_DBRP_DMA_RESET                                                    (0)
#define O_RXBRP_WCT_DMA_DBRP_DMA_CH0                                                      (1)
#define O_RXBRP_WCT_DMA_DBRP_DMA_CH0_REQ                                                  (2)
#define O_RXBRP_WCT_DMA_DBRP_DMA_CH0_CTRL                                                 (3)
#define O_RXBRP_WCT_DMA_DBRP_DMA_CH0_CTRL_DATA_PING                                       (4)
#define O_RXBRP_WCT_DMA_DBRP_DMA_CH0_CTRL_DATA_PONG                                       (5)
#define O_RXBRP_WCT_DMA_DBRP_DMA_CH0_CTRL_DATA                                            (6)
#define O_RXBRP_WCT_DMA_DBRP_DMA_CH1                                                      (7)
