#ifndef __STDO_RX_EVENTGEN_H__
#define __STDO_RX_EVENTGEN_H__

// ----------------- STDO_RX_EVENTGEN Register Definition -------------------
typedef volatile struct {
    kal_uint32 STDO_RXBRP_EVENT_OFFSET;                                                   // 0x0000
    kal_uint32 STDO_RXBRP_EVENT_MASK;                                                     // 0x0004
    kal_uint32 STDO_uSIP_IRQ_OFFSET;                                                      // 0x0008
    kal_uint32 STDO_uSIP_IRQ_MASK;                                                        // 0x000C
    kal_uint32 STDO_uSIP_IRQ_CLR;                                                         // 0x0010
    kal_uint32 STDO_uSIP_IRQ_SRC;                                                         // 0x0014
    kal_uint32 STDO_uSIP_IRQ_ISR;                                                         // 0x0018
    kal_uint32 STDO_RXDFE_ON_EVENT;                                                       // 0x001C
    kal_uint32 STDO_RXDFE_OFF_EVENT;                                                      // 0x0020
    kal_uint32 STDO_DBG_ON_EVENT;                                                         // 0x0024
    kal_uint32 STDO_DBG_OFF_EVENT;                                                        // 0x0028
    kal_uint32 STDO_TTR_ON_EVENT;                                                         // 0x002C
    kal_uint32 STDO_TTR_OFF_EVENT;                                                        // 0x0030
    kal_uint32 STDO_DVFS_EVENT;                                                           // 0x0034
    kal_uint32 rsv_0038[958];                                                             // 0x0038..0x0F2C
    kal_uint32 STDO_RX_BSIRD_EVENT[3];                                                    // 0x0F30..0x0F38
    kal_uint32 rsv_0F3C[61];                                                              // 0x0F3C..0x102C
    kal_uint32 STDO_RX_BSI_EVENT[45];                                                     // 0x1030..0x10E0
    kal_uint32 rsv_10E4[967];                                                             // 0x10E4..0x1FFC
    kal_uint32 STDO_RX_MIPI_EVENT[77];                                                    // 0x2000..0x2130
    kal_uint32 rsv_2134[947];                                                             // 0x2134..0x2FFC
    kal_uint32 STDO_RX_BPI_EVENT[34];                                                     // 0x3000..0x3084
    kal_uint32 rsv_3088[11229];                                                           // 0x3088..0xDFF8
    kal_uint8  rsv_DFFC;                                                                  // DFFC
    kal_uint16 rsv_DFFD;                                                                  // DFFD
    kal_uint8 rsv_E0FF;                                                                   // E0FF
    kal_uint32 rsv_E100[959];                                                             // 0xE100..0xEFF8
    kal_uint8  rsv_EFFC;                                                                  // EFFC
    kal_uint16 rsv_EFFD;                                                                  // EFFD
} STDO_RX_EVENTGEN_REGS, *PSTDO_RX_EVENTGEN_REGS;

// ---------- STDO_RX_EVENTGEN word-offset  ----------
#define O_STDO_RX_EVENTGEN_STDO_RXBRP_EVENT_OFFSET                               (0)
#define O_STDO_RX_EVENTGEN_STDO_RXBRP_EVENT_MASK                                 (1)
#define O_STDO_RX_EVENTGEN_STDO_uSIP_IRQ_OFFSET                                  (2)
#define O_STDO_RX_EVENTGEN_STDO_uSIP_IRQ_MASK                                    (3)
#define O_STDO_RX_EVENTGEN_STDO_uSIP_IRQ_CLR                                     (4)
#define O_STDO_RX_EVENTGEN_STDO_uSIP_IRQ_SRC                                     (5)
#define O_STDO_RX_EVENTGEN_STDO_uSIP_IRQ_ISR                                     (6)
#define O_STDO_RX_EVENTGEN_STDO_RXDFE_ON_EVENT                                   (7)
#define O_STDO_RX_EVENTGEN_STDO_RXDFE_OFF_EVENT                                  (8)
